{
  "nodes": {
    "a1_survival_talk": {
      "id": "a1_survival_talk",
      "messages": [
        {
          "en": "Honestly? Luck. The facility has a bunker level with emergency rations. Enough food and water for maybe another week.",
          "fr": "Honnêtement ? La chance. Le centre a un niveau bunker avec des rations d'urgence. Assez de bouffe et d'eau pour peut-être encore une semaine."
        },
        {
          "en": "I've been careful. Barricaded the main doors. Only go out when I have to.",
          "fr": "J'ai fait gaffe. J'ai barricadé les portes principales. Je sors que quand j'ai pas le choix."
        },
        {
          "en": "But I can't stay here forever. The rations are running low, and... there are noises at night. Things moving in the lower levels.",
          "fr": "Mais je peux pas rester là éternellement. Les rations baissent, et... y'a des bruits la nuit. Des trucs qui bougent dans les niveaux inférieurs."
        }
      ],
      "choices": [],
      "next_node": "a1_decision_point",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_inversion_result": {
      "id": "a5_inversion_result",
      "messages": [
        {
          "en": "...",
          "fr": "..."
        },
        {
          "en": "I'm... I'm still here. I think. The light is gone. The rift is closed. The chamber is dark and silent.",
          "fr": "J'suis... j'suis encore là. Je crois. La lumière est partie. La brèche est fermée. La salle est sombre et silencieuse."
        },
        {
          "en": "I can't move well. Everything hurts. My vision is blurred and there's this ringing in my ears that won't stop.",
          "fr": "J'arrive pas bien à bouger. Tout me fait mal. Ma vision est floue et y'a cet acouphène qui s'arrête pas."
        },
        {
          "en": "But outside... I can hear voices. Real voices. Not whispers. People. Confused, scared, but alive. The vanished — they're coming back.",
          "fr": "Mais dehors... j'entends des voix. De vraies voix. Pas des chuchotements. Des gens. Confus, effrayés, mais vivants. Les disparus — ils reviennent."
        }
      ],
      "choices": [],
      "next_node": "a5_ending_signal",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_day4": {
      "id": "a2_day4",
      "messages": [
        {
          "en": "I can see it.",
          "fr": "Je le vois."
        },
        {
          "en": "It's a town. Or what used to be one. Buildings are mostly intact but everything's covered in this... grey dust. Like ash but finer.",
          "fr": "C'est un village. Ou ce que c'était. Les bâtiments sont plutôt intacts mais tout est recouvert de cette... poussière grise. Comme de la cendre mais plus fine."
        },
        {
          "en": "The signal is coming from a large building at the center. Looks like it was a town hall or a school.",
          "fr": "Le signal vient d'un grand bâtiment au centre. On dirait une mairie ou une école."
        },
        {
          "en": "And there are lights. Actual lights. Someone has power in there.",
          "fr": "Et y'a des lumières. De vraies lumières. Quelqu'un a de l'électricité là-dedans."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Approach carefully. Scout the area first before going in.",
            "fr": "Approche-toi prudemment. Observe la zone d'abord avant d'entrer."
          },
          "next_node": "a2_scout_town",
          "flags_set": [
            "scouted_town"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Go in. If they have power, they have organization. This could be the safe zone.",
            "fr": "Vas-y. S'ils ont de l'électricité, ils sont organisés. C'est peut-être la zone sûre."
          },
          "next_node": "a2_enter_town",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_inversion": {
      "id": "a4_inversion",
      "messages": [
        {
          "en": "Okay. I'm doing it. I'm stepping into the resonance field.",
          "fr": "Bon. Je le fais. J'entre dans le champ de résonance."
        },
        {
          "en": "It feels like... like being everywhere at once. I can feel the other side. I can feel them. All the vanished people. They're reaching out.",
          "fr": "Ça fait comme... comme être partout en même temps. Je sens l'autre côté. Je les sens. Tous les gens disparus. Ils tendent les mains."
        },
        {
          "en": "I'm calibrating the inversion. My hands are moving but I don't think it's entirely me controlling them. Something is guiding me.",
          "fr": "Je calibre l'inversion. Mes mains bougent mais je crois que c'est pas entièrement moi qui les contrôle. Quelque chose me guide."
        },
        {
          "en": "The light is blinding. I can't—",
          "fr": "La lumière est aveuglante. Je peux pas—"
        }
      ],
      "choices": [],
      "next_node": "a5_inversion_result",
      "delay": 60,
      "ending": null,
      "trust_refusal": null
    },
    "a3_slip_away": {
      "id": "a3_slip_away",
      "messages": [
        {
          "en": "I grabbed my pack and slipped out the back while everyone was focused on Kai's group. I feel terrible about it.",
          "fr": "J'ai attrapé mon sac et j'me suis faufilée par derrière pendant que tout le monde était focalisé sur le groupe de Kaï. Je me sens horrible."
        },
        {
          "en": "But the mission matters more. If I can stop the Eshara, none of this fighting matters anyway.",
          "fr": "Mais la mission compte plus. Si je peux arrêter l'Eshara, tout ce conflit n'aura plus d'importance."
        },
        {
          "en": "At least... that's what I'm telling myself.",
          "fr": "Au moins... c'est ce que je me dis."
        }
      ],
      "choices": [],
      "next_node": "a3_day7",
      "delay": 180,
      "ending": null,
      "trust_refusal": null
    },
    "a4_miroir_door": {
      "id": "a4_miroir_door",
      "messages": [
        {
          "en": "I'm at the door. The keycard reader is still powered. Green light. Deep breath.",
          "fr": "J'suis devant la porte. Le lecteur de badge est toujours alimenté. Lumière verte. Grande inspiration."
        },
        {
          "en": "It worked. The door opened.",
          "fr": "Ça a marché. La porte s'est ouverte."
        },
        {
          "en": "Oh god.",
          "fr": "Oh mon dieu."
        },
        {
          "en": "The room beyond is... it's enormous. Way bigger than it should be. The ceiling is impossibly high. And in the center there's this... thing. A column of light. But it's not really light. It's more like a tear in the air itself.",
          "fr": "La salle derrière est... elle est énorme. Bien plus grande qu'elle devrait. Le plafond est impossiblement haut. Et au centre y'a ce... truc. Une colonne de lumière. Mais c'est pas vraiment de la lumière. C'est plutôt comme une déchirure dans l'air."
        },
        {
          "en": "That's it. That's the rift. That's what's causing the Eshara.",
          "fr": "C'est ça. C'est la brèche. C'est ce qui cause l'Eshara."
        }
      ],
      "choices": [],
      "next_node": "a4_console",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_alternative": {
      "id": "a4_alternative",
      "messages": [
        {
          "en": "I'm looking through the console... there's a second option. 'Resonance Inversion.' It says it would reverse the cascade instead of shutting it down.",
          "fr": "Je cherche dans la console... y'a une deuxième option. « Inversion de résonance. » Ça dit que ça inverserait la cascade au lieu de l'arrêter."
        },
        {
          "en": "But the warning says: 'Inversion requires manual calibration from within the resonance field. Operator exposure to rift energy will be significant and potentially fatal.'",
          "fr": "Mais l'avertissement dit : « L'inversion nécessite un calibrage manuel depuis l'intérieur du champ de résonance. L'exposition de l'opérateur à l'énergie de la brèche sera significative et potentiellement fatale. »"
        },
        {
          "en": "So my choices are: run and hope the timed shutdown works, or step into the rift field and try to reverse it myself. If I reverse it, the vanished people might come back. But I might not survive it.",
          "fr": "Alors mes choix sont : courir et espérer que l'arrêt minuteur marche, ou entrer dans le champ de la brèche et essayer d'inverser moi-même. Si j'inverse, les gens disparus pourraient revenir. Mais je survivrai peut-être pas."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Set the timer and run. Your life matters too.",
            "fr": "Mets le minuteur et cours. Ta vie compte aussi."
          },
          "next_node": "a4_timed_shutdown",
          "flags_set": [
            "timed_shutdown"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Try the inversion. If there's a chance to bring people back...",
            "fr": "Tente l'inversion. S'il y a une chance de ramener les gens..."
          },
          "next_node": "a4_inversion",
          "flags_set": [
            "sacrifice_made",
            "attempted_inversion"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_day7": {
      "id": "a3_day7",
      "messages": [
        {
          "en": "I'm on the move. Heading south, back toward Helios. The landscape feels different now. Worse.",
          "fr": "J'suis en route. Direction sud, retour vers Helios. Le paysage semble différent maintenant. Pire."
        },
        {
          "en": "The sky flickers every few hours now. And the whispers are constant. Not louder, just... always there. Like background noise.",
          "fr": "Le ciel scintille toutes les quelques heures maintenant. Et les chuchotements sont constants. Pas plus forts, juste... toujours là. Comme un bruit de fond."
        },
        {
          "en": "I saw a group of changed ones in the distance. They were walking in a perfect circle. Round and round. It was the most disturbing thing I've ever seen.",
          "fr": "J'ai vu un groupe de changés au loin. Ils marchaient en cercle parfait. Encore et encore. C'était la chose la plus perturbante que j'ai jamais vue."
        },
        {
          "en": "I'm scared. But I'm not stopping.",
          "fr": "J'ai peur. Mais je m'arrête pas."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "You're the bravest person I know. Keep going.",
            "fr": "T'es la personne la plus courageuse que je connaisse. Continue."
          },
          "next_node": "a3_end",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              2
            ],
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Stay away from the changed ones. Don't let them see you.",
            "fr": "Reste loin des changés. Les laisse pas te voir."
          },
          "next_node": "a3_end",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_immediate_shutdown": {
      "id": "a4_immediate_shutdown",
      "messages": [
        {
          "en": "You're right. No time to waste. Every second this thing runs, more people suffer.",
          "fr": "T'as raison. Pas de temps à perdre. Chaque seconde où ce truc tourne, plus de gens souffrent."
        },
        {
          "en": "I'm initiating the shutdown sequence. The console is vibrating. The rift is reacting — it's getting brighter.",
          "fr": "Je lance la séquence d'arrêt. La console vibre. La brèche réagit — elle devient plus brillante."
        },
        {
          "en": "Running. I'm running as fast as I can.",
          "fr": "Je cours. Je cours aussi vite que je peux."
        }
      ],
      "choices": [],
      "next_node": "a5_escape_run",
      "delay": 60,
      "ending": null,
      "trust_refusal": null
    },
    "a3_kai_twist": {
      "id": "a3_kai_twist",
      "messages": [
        {
          "en": "Kai showed up at the settlement.",
          "fr": "Kaï est arrivé à la colonie."
        },
        {
          "en": "But he didn't come alone. He brought a group. And they're not friendly. They want the generator. They want the food. They want control.",
          "fr": "Mais il est pas venu seul. Il a amené un groupe. Et ils sont pas amicaux. Ils veulent le générateur. Ils veulent la nourriture. Ils veulent le contrôle."
        },
        {
          "en": "He was scouting for them all along. All that 'nice guy alone in the wild' stuff... it was an act.",
          "fr": "Il faisait du repérage pour eux depuis le début. Tout ce numéro du « mec sympa seul dans la nature »... c'était du ciné."
        }
      ],
      "choices": [],
      "next_node": "a3_kai_confrontation",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_approach_console": {
      "id": "a4_approach_console",
      "messages": [
        {
          "en": "I'm at the console. My hands are shaking. The screens show the resonance frequency, power levels, cascade status.",
          "fr": "J'suis à la console. Mes mains tremblent. Les écrans montrent la fréquence de résonance, les niveaux d'énergie, le statut de la cascade."
        },
        {
          "en": "There's a shutdown sequence. But there's a warning: 'Shutdown will collapse the rift. Estimated collapse radius: 200 meters. All personnel must evacuate before initiation.'",
          "fr": "Y'a une séquence d'arrêt. Mais y'a un avertissement : « L'arrêt provoquera l'effondrement de la brèche. Rayon d'effondrement estimé : 200 mètres. Tout le personnel doit évacuer avant le déclenchement. »"
        },
        {
          "en": "200 meters. I'm maybe 10 meters from the rift right now. This room is underground. Getting out in time...",
          "fr": "200 mètres. J'suis à peut-être 10 mètres de la brèche. Cette salle est souterraine. Sortir à temps..."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Set a timer on the shutdown. Give yourself time to run.",
            "fr": "Mets un minuteur sur l'arrêt. Donne-toi le temps de courir."
          },
          "next_node": "a4_timed_shutdown",
          "flags_set": [
            "timed_shutdown"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Is there another way? Can the rift be sealed without the collapse?",
            "fr": "Y'a un autre moyen ? On peut sceller la brèche sans l'effondrement ?"
          },
          "next_node": "a4_alternative",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Do it now. Hit the button. Saving the world is worth the risk.",
            "fr": "Fais-le maintenant. Appuie sur le bouton. Sauver le monde vaut le risque."
          },
          "next_node": "a4_immediate_shutdown",
          "flags_set": [
            "sacrifice_made"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_facility_reflect": {
      "id": "a1_facility_reflect",
      "messages": [
        {
          "en": "Yeah. I'm coming back up. Got enough supplies to last maybe two more weeks now. That's something.",
          "fr": "Ouais. Je remonte. J'ai assez de provisions pour tenir peut-être encore deux semaines maintenant. C'est déjà ça."
        },
        {
          "en": "I keep thinking about that notebook. 'Resonance cascade.' If they were doing something here that caused all this...",
          "fr": "J'arrête pas de penser à ce carnet. « Cascade de résonance. » Si c'est quelque chose qu'ils faisaient ici qui a causé tout ça..."
        },
        {
          "en": "Anyway. I need to rest. My arm hurts and I'm exhausted. I'll set up camp upstairs and message you in the morning.",
          "fr": "Bref. Faut que je me repose. Mon bras me fait mal et j'suis crevée. Je vais m'installer en haut et je te message demain matin."
        },
        {
          "en": "Thank you. For being here. Seriously.",
          "fr": "Merci. D'être là. Vraiment."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Get some rest. You've earned it. I'll be here when you wake up.",
            "fr": "Repose-toi. Tu l'as bien mérité. J'serai là quand tu te réveilleras."
          },
          "next_node": "a1_night",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ],
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Sleep well, Elara. Tomorrow we figure out the next move.",
            "fr": "Dors bien, Elara. Demain on décide de la suite."
          },
          "next_node": "a1_night",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_elara_helps_anyway": {
      "id": "a2_elara_helps_anyway",
      "messages": [
        {
          "en": "I gave her some water and wrapped her leg as best I could. She told me about a shortcut through the valley. Might be useful.",
          "fr": "Je lui ai donné de l'eau et j'ai bandé sa jambe du mieux que j'ai pu. Elle m'a parlé d'un raccourci par la vallée. Ça pourrait être utile."
        },
        {
          "en": "I know you don't agree. But some things are more important than survival strategy.",
          "fr": "Je sais que t'es pas d'accord. Mais certaines choses sont plus importantes que la stratégie de survie."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_evening",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_ending_gone_dark": {
      "id": "a5_ending_gone_dark",
      "messages": [
        {
          "en": "I'm tired. So tired.",
          "fr": "J'suis fatiguée. Tellement fatiguée."
        },
        {
          "en": "Thank you for being with me. Through all of this. You made me brave.",
          "fr": "Merci d'avoir été avec moi. À travers tout ça. Tu m'as rendue courageuse."
        },
        {
          "en": "I'm going to close my eyes. Just for a bit.",
          "fr": "Je vais fermer les yeux. Juste un peu."
        },
        {
          "en": "The sky really is beautiful today.",
          "fr": "Le ciel est vraiment beau aujourd'hui."
        },
        {
          "en": "...",
          "fr": "..."
        }
      ],
      "choices": [],
      "next_node": null,
      "delay": null,
      "ending": "GoneDark",
      "trust_refusal": null
    },
    "a4_search_first": {
      "id": "a4_search_first",
      "messages": [
        {
          "en": "Found a few more things in the storage room. Extra batteries for the flashlight. That's huge — I'm going to need light down there.",
          "fr": "Trouvé quelques trucs en plus dans la salle de stockage. Des piles supplémentaires pour la lampe. C'est énorme — j'aurai besoin de lumière là-dessous."
        },
        {
          "en": "Also found a note taped to the inside of a locker. It says: 'If anyone finds this — DO NOT open the resonance chamber. The rift cannot be closed from outside. You'd need to—' And then it's torn. Great.",
          "fr": "J'ai aussi trouvé un mot scotché dans un casier. Il dit : « Si quelqu'un trouve ceci — N'OUVREZ PAS la chambre de résonance. La brèche ne peut pas être fermée de l'extérieur. Il faudrait— » Et puis c'est déchiré. Super."
        }
      ],
      "choices": [],
      "next_node": "a4_miroir_door",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "intro": {
      "id": "intro",
      "messages": [
        {
          "en": "Hello? Is... is anyone there?",
          "fr": "Allô ? Est-ce que... y'a quelqu'un ?"
        },
        {
          "en": "Oh god, it works. The radio actually works.",
          "fr": "Oh mon dieu, ça marche. La radio marche vraiment."
        },
        {
          "en": "My name is Elara. I'm alone in what's left of the Helios Research Facility. Somewhere in the mountains, I think.",
          "fr": "Je m'appelle Elara. J'suis seule dans ce qu'il reste du Centre de Recherche Helios. Quelque part dans les montagnes, je crois."
        },
        {
          "en": "I found this device buried under rubble in one of the labs. I've been trying to get it to work for days.",
          "fr": "J'ai trouvé cet appareil sous les décombres dans un des labos. Ça fait des jours que j'essaie de le faire marcher."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Are you okay? What happened to you?",
            "fr": "Est-ce que ça va ? Qu'est-ce qui t'est arrivé ?"
          },
          "next_node": "a1_response_calm",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Where exactly are you? What's this facility?",
            "fr": "T'es où exactement ? C'est quoi ce centre ?"
          },
          "next_node": "a1_response_direct",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_north_shelter": {
      "id": "a1_north_shelter",
      "messages": [
        {
          "en": "Okay, settled in for the night. Not exactly the Ritz, but it'll do.",
          "fr": "Bon, installée pour la nuit. C'est pas le Ritz, mais ça fera."
        },
        {
          "en": "I need to sleep. My legs are killing me and I haven't walked that much in... well, three months.",
          "fr": "Faut que je dorme. J'ai les jambes en compote et j'ai pas autant marché depuis... bah, trois mois."
        },
        {
          "en": "Thanks for keeping me company today. It made a difference. Really.",
          "fr": "Merci de m'avoir tenu compagnie aujourd'hui. Ça a fait une différence. Vraiment."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Rest up. Tomorrow we find those people.",
            "fr": "Repose-toi. Demain on trouve ces gens."
          },
          "next_node": "a1_night",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Good night, Elara. Stay safe.",
            "fr": "Bonne nuit, Elara. Fais attention à toi."
          },
          "next_node": "a1_night",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_morning": {
      "id": "a2_morning",
      "messages": [
        {
          "en": "Morning. I think. Hard to tell when the sky always looks like a bruise.",
          "fr": "Bonjour. Je crois. Dur à dire quand le ciel a toujours l'air d'un bleu."
        },
        {
          "en": "Slept badly. Kept hearing this low hum, like something vibrating underground. Might just be my imagination.",
          "fr": "J'ai mal dormi. J'arrêtais pas d'entendre ce bourdonnement sourd, comme un truc qui vibre sous terre. C'est peut-être mon imagination."
        },
        {
          "en": "Anyway. New day. Time to move.",
          "fr": "Bref. Nouveau jour. Faut bouger."
        }
      ],
      "choices": [],
      "next_node": "a2_morning_choice",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_aftermath": {
      "id": "a3_aftermath",
      "messages": [
        {
          "en": "The settlement is tense. People are scared. Dr. Osei thinks Kai's group will be back, probably with more people.",
          "fr": "La colonie est tendue. Les gens ont peur. Le Dr Osei pense que le groupe de Kaï va revenir, probablement avec plus de monde."
        },
        {
          "en": "She pulled me aside. She says time is running out — the phenomena are accelerating. If I'm going to go back to Helios, it has to be now.",
          "fr": "Elle m'a prise à part. Elle dit que le temps presse — les phénomènes s'accélèrent. Si je dois retourner à Helios, c'est maintenant."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "...",
            "fr": "..."
          },
          "next_node": "a3_stayed_safe_aftermath",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "FlagSet": "stayed_safe"
            }
          ]
        },
        {
          "label": {
            "en": "Go now. Every hour counts.",
            "fr": "Pars maintenant. Chaque heure compte."
          },
          "next_node": "a3_day7",
          "flags_set": [
            "has_lab_keycard"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "FlagUnset": "stayed_safe"
            }
          ]
        },
        {
          "label": {
            "en": "Stay one more night to rest and prepare. You'll need your strength.",
            "fr": "Reste une nuit de plus pour te reposer et te préparer. T'auras besoin de tes forces."
          },
          "next_node": "a3_one_more_night",
          "flags_set": [
            "has_lab_keycard"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "health",
              1
            ]
          ],
          "conditions": [
            {
              "FlagUnset": "stayed_safe"
            }
          ]
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_ignore_whispers": {
      "id": "a2_ignore_whispers",
      "messages": [
        {
          "en": "Yeah. Yeah, you're right. Nothing good comes from chasing phantom voices in the apocalypse.",
          "fr": "Ouais. Ouais, t'as raison. Rien de bon vient de courir après des voix fantômes pendant l'apocalypse."
        },
        {
          "en": "I'm picking up the pace. The sooner I get to wherever that signal is, the better.",
          "fr": "J'accélère le pas. Plus vite j'arrive où que ce signal mène, mieux c'est."
        }
      ],
      "choices": [],
      "next_node": "a2_resource_check",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_arrival": {
      "id": "a4_arrival",
      "messages": [
        {
          "en": "I'm here. Helios. It looks worse than when I left. The walls are cracked, there's that grey dust everywhere, and the air feels heavy.",
          "fr": "J'y suis. Helios. C'est pire que quand je suis partie. Les murs sont fissurés, y'a cette poussière grise partout, et l'air est lourd."
        },
        {
          "en": "The sky above the facility is... wrong. It's darker here. Like a permanent eclipse. And I can see something shimmering above the main building. Like a heat haze, but vertical.",
          "fr": "Le ciel au-dessus du centre est... pas normal. C'est plus sombre ici. Comme une éclipse permanente. Et je vois un truc qui miroite au-dessus du bâtiment principal. Comme un mirage, mais vertical."
        },
        {
          "en": "The whispers are loud here. Not painful, just... insistent. Like they're trying to tell me something.",
          "fr": "Les chuchotements sont forts ici. Pas douloureux, juste... insistants. Comme s'ils essayaient de me dire quelque chose."
        }
      ],
      "choices": [],
      "next_node": "a4_enter_helios",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_defend": {
      "id": "a3_defend",
      "messages": [
        {
          "en": "We held them off. Barely. There were tense moments. Someone fired a warning shot. Kai's group realized we weren't easy targets.",
          "fr": "On les a repoussés. De justesse. Y'a eu des moments tendus. Quelqu'un a tiré un coup de semonce. Le groupe de Kaï a réalisé qu'on était pas des proies faciles."
        },
        {
          "en": "They pulled back to the tree line. But they're still out there. Watching.",
          "fr": "Ils se sont repliés en lisière de forêt. Mais ils sont toujours là. À observer."
        }
      ],
      "choices": [],
      "next_node": "a3_aftermath",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_ending_signal": {
      "id": "a5_ending_signal",
      "messages": [
        {
          "en": "I did it. The inversion worked. The Eshara is reversing. People are coming back.",
          "fr": "Je l'ai fait. L'inversion a marché. L'Eshara s'inverse. Les gens reviennent."
        },
        {
          "en": "But I'm... I'm not okay. The exposure changed something in me. I can see both worlds now. Layered on top of each other. It's beautiful and horrible.",
          "fr": "Mais je... j'suis pas bien. L'exposition a changé quelque chose en moi. Je vois les deux mondes maintenant. Superposés. C'est beau et horrible."
        },
        {
          "en": "Dr. Osei says I might recover. Or I might not. Time will tell.",
          "fr": "Le Dr Osei dit que je pourrais guérir. Ou pas. Le temps dira."
        },
        {
          "en": "But the world is healing. That's what matters. The signal worked. I was the signal.",
          "fr": "Mais le monde guérit. C'est ce qui compte. Le signal a marché. J'étais le signal."
        },
        {
          "en": "Thank you for being my anchor. Through all of it. You kept me human when everything else tried not to.",
          "fr": "Merci d'avoir été mon ancre. À travers tout ça. Tu m'as gardée humaine quand tout le reste essayait de pas l'être."
        }
      ],
      "choices": [],
      "next_node": null,
      "delay": null,
      "ending": "TheSignal",
      "trust_refusal": null
    },
    "a2_toward_smoke": {
      "id": "a2_toward_smoke",
      "messages": [
        {
          "en": "The smoke's coming from behind a ridge. Walking toward it now.",
          "fr": "La fumée vient de derrière une crête. J'avance vers elle."
        },
        {
          "en": "I can see a small camp. One tent, a fire. And... there's someone there. A man. He's seen me too.",
          "fr": "Je vois un petit campement. Une tente, un feu. Et... y'a quelqu'un. Un homme. Il m'a vue aussi."
        }
      ],
      "choices": [],
      "next_node": "a2_meet_kai",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "a1_eshara_explain": {
      "id": "a1_eshara_explain",
      "messages": [
        {
          "en": "One day the sky just... flickered. Like a screen glitching. And then everything electronic died. All at once.",
          "fr": "Un jour le ciel a juste... scintillé. Comme un écran qui bug. Et puis tout ce qui était électronique est mort. D'un coup."
        },
        {
          "en": "Most people vanished. Not dead — just gone. Empty clothes left behind. Cars still running but no drivers.",
          "fr": "La plupart des gens ont disparu. Pas morts — juste partis. Des vêtements vides laissés derrière. Des voitures qui tournent encore mais sans conducteurs."
        },
        {
          "en": "The ones who stayed... some are okay. Others are... different. Aggressive. Like they're not really there anymore.",
          "fr": "Ceux qui sont restés... certains vont bien. D'autres sont... différents. Agressifs. Comme s'ils étaient plus vraiment là."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "That's terrifying. How have you survived this long?",
            "fr": "C'est terrifiant. Comment t'as survécu aussi longtemps ?"
          },
          "next_node": "a1_survival_talk",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ],
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "What do you mean 'different'? What are they like?",
            "fr": "Comment ça 'différents' ? Ils sont comment ?"
          },
          "next_node": "a1_changed_ones",
          "flags_set": [
            "asked_about_changed"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_changed_ones": {
      "id": "a1_changed_ones",
      "messages": [
        {
          "en": "I saw a group of them about a month ago. They were just... standing in a field. Staring at the sky. Completely still.",
          "fr": "J'ai vu un groupe y'a environ un mois. Ils étaient juste... debout dans un champ. À fixer le ciel. Complètement immobiles."
        },
        {
          "en": "When I got closer, one of them turned. Her eyes were wrong. Like static. And she made this sound... I still hear it sometimes when I try to sleep.",
          "fr": "Quand je me suis approchée, une d'entre eux s'est retournée. Ses yeux étaient pas normaux. Comme du grésillement. Et elle a fait ce bruit... je l'entends encore parfois quand j'essaie de dormir."
        },
        {
          "en": "I ran. I don't know if they're dangerous exactly, but something is very, very wrong with them.",
          "fr": "J'ai couru. J'sais pas s'ils sont dangereux exactement, mais y'a un truc qui va vraiment, vraiment pas chez eux."
        }
      ],
      "choices": [],
      "next_node": "a1_decision_point",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_both_attempt": {
      "id": "a1_both_attempt",
      "messages": [
        {
          "en": "I... I don't think that's realistic. If I go into the lower levels AND try to trek north the same day, I'll be exhausted and exposed at nightfall.",
          "fr": "Je... je crois pas que ce soit réaliste. Si j'explore les niveaux inférieurs ET j'essaie de marcher vers le nord le même jour, j'serai épuisée et exposée à la tombée de la nuit."
        },
        {
          "en": "I need to pick one. What's more important right now — information, or people?",
          "fr": "Faut que je choisisse. Qu'est-ce qui est plus important là — les infos, ou les gens ?"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "You're right. Explore the facility — knowledge is power.",
            "fr": "T'as raison. Explore le centre — le savoir c'est le pouvoir."
          },
          "next_node": "a1_explore_facility",
          "flags_set": [
            "explored_facility"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "You're right. Head north — people first.",
            "fr": "T'as raison. Va vers le nord — les gens d'abord."
          },
          "next_node": "a1_head_north",
          "flags_set": [
            "headed_north"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_partial_help": {
      "id": "a2_partial_help",
      "messages": [
        {
          "en": "I gave her water and pointed her south. Told her about the gas station I passed. It's not much, but it's something.",
          "fr": "Je lui ai donné de l'eau et je l'ai orientée vers le sud. Je lui ai parlé de la station-service que j'ai passée. C'est pas grand-chose, mais c'est quelque chose."
        },
        {
          "en": "She thanked me. Told me about a bunker entrance she'd seen near a dried-up lake to the north. Said it might have supplies.",
          "fr": "Elle m'a remerciée. Elle m'a parlé d'une entrée de bunker qu'elle avait vue près d'un lac asséché au nord. Elle dit qu'y a peut-être des provisions."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_evening",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_eshara_buildup": {
      "id": "a5_eshara_buildup",
      "messages": [
        {
          "en": "Something's wrong. Since I looked into the rift, I feel... different. The whispers aren't background noise anymore. They're words. I can understand them.",
          "fr": "Quelque chose va pas. Depuis que j'ai regardé dans la brèche, je me sens... différente. Les chuchotements sont plus du bruit de fond. Ce sont des mots. Je les comprends."
        },
        {
          "en": "They're saying my name. Over and over. And it feels... warm. Welcoming. Like coming home.",
          "fr": "Ils disent mon nom. Encore et encore. Et c'est... chaud. Accueillant. Comme rentrer chez soi."
        },
        {
          "en": "I don't think I'm afraid anymore. Is that good?",
          "fr": "Je crois que j'ai plus peur. C'est bien ça ?"
        }
      ],
      "choices": [],
      "next_node": "a5_ending_eshara_wins",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_day6": {
      "id": "a3_day6",
      "messages": [
        {
          "en": "Something happened. Something bad.",
          "fr": "Y'a eu un truc. Un mauvais truc."
        }
      ],
      "choices": [],
      "next_node": "a3_kai_twist",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_morning_choice": {
      "id": "a2_morning_choice",
      "messages": [
        {
          "en": "I need to figure out my next move. I can see smoke in the distance to the northwest. Someone's got a fire going. And that signal from the north is still faintly pulsing.",
          "fr": "Faut que je décide de la suite. Je vois de la fumée au loin vers le nord-ouest. Quelqu'un a allumé un feu. Et le signal du nord pulse toujours faiblement."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Head toward the smoke. Where there's fire, there are people.",
            "fr": "Va vers la fumée. Là où y'a du feu, y'a des gens."
          },
          "next_node": "a2_toward_smoke",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Keep following the signal north. Stay focused on the original plan.",
            "fr": "Continue à suivre le signal vers le nord. Reste concentrée sur le plan initial."
          },
          "next_node": "a2_continue_north",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_decision_point": {
      "id": "a1_decision_point",
      "messages": [
        {
          "en": "Look, I need to make a decision and I... I could really use someone to think this through with.",
          "fr": "Ecoute, faut que je prenne une décision et je... j'aurais vraiment besoin de quelqu'un pour réfléchir avec moi."
        },
        {
          "en": "There are two options. The facility has lower levels I haven't explored. Labs, storage rooms, maybe a server room. Could have supplies, maybe even answers about what happened. But I've heard things down there. It's risky.",
          "fr": "Y'a deux options. Le centre a des niveaux inférieurs que j'ai pas explorés. Des labos, des salles de stockage, peut-être une salle serveur. Y'a peut-être des provisions, voire des réponses sur ce qui s'est passé. Mais j'entends des trucs en bas. C'est risqué."
        },
        {
          "en": "Or... I picked up a faint signal from the north two days ago. It could be other survivors. A safe zone. Or it could be nothing. It's at least a day's hike through open terrain.",
          "fr": "Ou alors... j'ai capté un faible signal venant du nord y'a deux jours. Ça pourrait être d'autres survivants. Une zone sûre. Ou ça pourrait être rien. C'est au moins une journée de marche en terrain découvert."
        },
        {
          "en": "What do you think I should do?",
          "fr": "T'en penses quoi ?"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Explore the lower levels. You need supplies and answers.",
            "fr": "Explore les niveaux inférieurs. T'as besoin de provisions et de réponses."
          },
          "next_node": "a1_explore_facility",
          "flags_set": [
            "explored_facility"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Head north toward the signal. People are more important than supplies.",
            "fr": "Dirige-toi vers le nord, vers le signal. Les gens c'est plus important que les provisions."
          },
          "next_node": "a1_head_north",
          "flags_set": [
            "headed_north"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Can you do a quick search of the facility first, then head north?",
            "fr": "Tu pourrais fouiller vite fait le centre d'abord, puis aller vers le nord ?"
          },
          "next_node": "a1_both_attempt",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_ending_new_dawn": {
      "id": "a5_ending_new_dawn",
      "messages": [
        {
          "en": "The signal from the settlement is still there. I'm heading back. I'm going home. Well... the closest thing to home I have now.",
          "fr": "Le signal de la colonie est toujours là. J'y retourne. Je rentre chez moi. Enfin... ce qui s'en rapproche le plus maintenant."
        },
        {
          "en": "The phenomena have stopped. No more flickering. No more whispers. The changed ones... I saw one on my way back. She was just standing there, confused. Human again. Scared, but human.",
          "fr": "Les phénomènes ont cessé. Plus de scintillement. Plus de chuchotements. Les changés... j'en ai vu une sur le chemin du retour. Elle était là, confuse. Humaine à nouveau. Effrayée, mais humaine."
        },
        {
          "en": "I don't know if the vanished will come back. But the world is healing. And I'm alive.",
          "fr": "J'sais pas si les disparus reviendront. Mais le monde guérit. Et j'suis vivante."
        },
        {
          "en": "Thank you. For everything. I wouldn't be here without you. Literally.",
          "fr": "Merci. Pour tout. Je serais pas là sans toi. Littéralement."
        },
        {
          "en": "This is the start of something new. A new dawn. And I'm ready for it.",
          "fr": "C'est le début de quelque chose de nouveau. Une aube nouvelle. Et j'suis prête."
        }
      ],
      "choices": [],
      "next_node": null,
      "delay": null,
      "ending": "NewDawn",
      "trust_refusal": null
    },
    "a2_conserve": {
      "id": "a2_conserve",
      "messages": [
        {
          "en": "You're probably right. I'll ration what I have. Found a sheltered spot behind the station to sleep.",
          "fr": "T'as sûrement raison. Je vais rationner ce que j'ai. J'ai trouvé un coin abrité derrière la station pour dormir."
        },
        {
          "en": "I'll try to find water tomorrow. There has to be a stream or something around here.",
          "fr": "J'essaierai de trouver de l'eau demain. Y doit bien y avoir un ruisseau ou un truc du genre dans le coin."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_morning",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "a1_facility_result": {
      "id": "a1_facility_result",
      "messages": [
        {
          "en": "Okay, I'm back. I'm okay. Mostly.",
          "fr": "Bon, j'suis revenue. Ça va. À peu près."
        },
        {
          "en": "The lower level is... it's been trashed. Someone or something tore through the labs. Equipment smashed, papers everywhere.",
          "fr": "Le niveau inférieur est... saccagé. Quelqu'un ou quelque chose a ravagé les labos. Équipements fracassés, des papiers partout."
        },
        {
          "en": "But I found a storage room that was still sealed. Canned food, water purification tablets, and a first aid kit. Score.",
          "fr": "Mais j'ai trouvé une salle de stockage encore scellée. Des conserves, des pastilles de purification d'eau, et une trousse de premiers secours. Jackpot."
        }
      ],
      "choices": [],
      "next_node": "a1_facility_discovery",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_kai_separate": {
      "id": "a2_kai_separate",
      "messages": [
        {
          "en": "He looked hurt but he understood. Said 'fair enough' and wished me luck.",
          "fr": "Il avait l'air blessé mais il a compris. Il a dit « je comprends » et m'a souhaité bonne chance."
        },
        {
          "en": "I feel kind of bad. But you're right, I can't just trust anyone. Not in this world.",
          "fr": "Je me sens un peu mal. Mais t'as raison, je peux pas faire confiance à n'importe qui. Pas dans ce monde."
        },
        {
          "en": "He did tell me about the river path before I left. Said to avoid the bridge — it's where he saw something wrong.",
          "fr": "Il m'a quand même parlé du chemin de la rivière avant que je parte. Il a dit d'éviter le pont — c'est là qu'il a vu un truc qui allait pas."
        }
      ],
      "choices": [],
      "next_node": "a2_travel_day2",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_travel_day2": {
      "id": "a2_travel_day2",
      "messages": [
        {
          "en": "Something weird just happened.",
          "fr": "Un truc bizarre vient de se passer."
        },
        {
          "en": "The sky flickered again. Just for a second. Like reality blinked. And my compass is going crazy — spinning in circles.",
          "fr": "Le ciel a scintillé encore. Juste une seconde. Comme si la réalité avait cligné. Et ma boussole déconne — elle tourne en boucle."
        },
        {
          "en": "And I can hear... whispers? It's faint. Like a crowd murmuring very far away. But there's nobody here.",
          "fr": "Et j'entends... des chuchotements ? C'est faible. Comme une foule qui murmure très loin. Mais y'a personne ici."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Stay calm. Don't follow the whispers. Keep moving north.",
            "fr": "Reste calme. Suis pas les chuchotements. Continue vers le nord."
          },
          "next_node": "a2_ignore_whispers",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Can you tell which direction the whispers are coming from?",
            "fr": "Tu peux dire de quelle direction viennent les chuchotements ?"
          },
          "next_node": "a2_investigate_whispers",
          "flags_set": [
            "investigated_whispers"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_help_lena": {
      "id": "a2_help_lena",
      "messages": [
        {
          "en": "I helped her. Set the leg with a branch and some torn cloth. She's in pain but she can sort of hobble now.",
          "fr": "Je l'ai aidée. J'ai immobilisé la jambe avec une branche et du tissu déchiré. Elle souffre mais elle arrive à boitiller maintenant."
        },
        {
          "en": "She told me about a shortcut through the valley. Said there's an old bunker entrance near a dried-up lake. Could be important.",
          "fr": "Elle m'a parlé d'un raccourci par la vallée. Elle dit qu'y a une entrée de bunker près d'un lac asséché. Ça pourrait être important."
        },
        {
          "en": "She's going to try to make it south. Said there's a farmhouse she knows about. I hope she makes it.",
          "fr": "Elle va essayer d'aller vers le sud. Elle dit qu'il y a une ferme qu'elle connaît. J'espère qu'elle y arrivera."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_evening",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a4_enter_helios": {
      "id": "a4_enter_helios",
      "messages": [
        {
          "en": "I'm going in. The main entrance is still barricaded from when I left. Good — means nothing got in.",
          "fr": "J'entre. L'entrée principale est encore barricadée depuis mon départ. Bon — ça veut dire que rien est entré."
        },
        {
          "en": "I can feel the vibration through the floor now. It's coming from below. From the MIROIR lab.",
          "fr": "Je sens la vibration à travers le sol maintenant. Ça vient d'en bas. Du labo MIROIR."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Head straight for the MIROIR door. Use the keycard.",
            "fr": "Va direct à la porte MIROIR. Utilise le badge."
          },
          "next_node": "a4_miroir_door",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "FlagSet": "has_lab_keycard"
            }
          ]
        },
        {
          "label": {
            "en": "Search for supplies first. You might need them.",
            "fr": "Cherche des provisions d'abord. T'en auras peut-être besoin."
          },
          "next_node": "a4_search_first",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "supplies",
              1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_scout_town": {
      "id": "a2_scout_town",
      "messages": [
        {
          "en": "Good call. I found a hill overlooking the town. Let me see...",
          "fr": "Bonne idée. J'ai trouvé une colline qui surplombe le village. Voyons voir..."
        },
        {
          "en": "I count maybe a dozen people moving around. They seem... normal. Building things, carrying supplies. There's even a garden.",
          "fr": "Je compte peut-être une douzaine de personnes qui bougent. Elles ont l'air... normales. Elles construisent des trucs, transportent des provisions. Y'a même un jardin."
        },
        {
          "en": "But there's also a wall being built around the perimeter. And I see someone on watch with what looks like a rifle.",
          "fr": "Mais y'a aussi un mur en construction autour du périmètre. Et je vois quelqu'un de garde avec ce qui ressemble à un fusil."
        },
        {
          "en": "These people are surviving, but they're also defending against something. Okay, I'm going in.",
          "fr": "Ces gens survivent, mais ils se défendent aussi contre quelque chose. Bon, j'y vais."
        }
      ],
      "choices": [],
      "next_node": "a2_enter_town",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "a1_response_calm": {
      "id": "a1_response_calm",
      "messages": [
        {
          "en": "I... I think so. Physically, at least. I've got some bruises, a cut on my arm that's not healing great, but I'm alive.",
          "fr": "Je... je crois que oui. Physiquement, en tout cas. J'ai des bleus, une coupure au bras qui guérit pas super bien, mais j'suis vivante."
        },
        {
          "en": "Mentally? I honestly don't know anymore. It's been three months since everything went sideways.",
          "fr": "Mentalement ? Honnêtement, j'sais plus trop. Ça fait trois mois que tout a basculé."
        },
        {
          "en": "They're calling it the Eshara. I don't even know who \"they\" are anymore. I just heard it on a broken broadcast a few weeks ago.",
          "fr": "Ils appellent ça l'Eshara. J'sais même plus qui \"ils\" sont. J'ai entendu ça sur une fréquence cassée y'a quelques semaines."
        }
      ],
      "choices": [],
      "next_node": "a1_eshara_explain",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_facility_search": {
      "id": "a1_facility_search",
      "messages": [
        {
          "en": "Going dark for a bit. Signal might cut out underground.",
          "fr": "Je coupe pour un moment. Le signal va sûrement sauter sous terre."
        }
      ],
      "choices": [],
      "next_node": "a1_facility_result",
      "delay": 180,
      "ending": null,
      "trust_refusal": null
    },
    "a2_night_day3": {
      "id": "a2_night_day3",
      "messages": [
        {
          "en": "Thanks. For everything. I don't think I'd have made it this far without you.",
          "fr": "Merci. Pour tout. Je crois que j'aurais pas tenu aussi loin sans toi."
        },
        {
          "en": "Good night. Tomorrow's a big day.",
          "fr": "Bonne nuit. Demain c'est un grand jour."
        }
      ],
      "choices": [],
      "next_node": "a2_day4",
      "delay": 300,
      "ending": null,
      "trust_refusal": null
    },
    "a3_elara_decides_keycard": {
      "id": "a3_elara_decides_keycard",
      "messages": [
        {
          "en": "I thought about it. I'm taking the keycard. I can't sit here knowing I might be the only person who can stop this.",
          "fr": "J'y ai réfléchi. Je prends le badge. Je peux pas rester là en sachant que je suis peut-être la seule personne qui peut arrêter ça."
        },
        {
          "en": "I know you might not agree. But this is my choice.",
          "fr": "Je sais que t'es peut-être pas d'accord. Mais c'est mon choix."
        }
      ],
      "choices": [],
      "next_node": "a3_preparation",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_explore_facility": {
      "id": "a1_explore_facility",
      "messages": [
        {
          "en": "Yeah. Yeah, you're right. If there are answers here, I need to find them. And I need more supplies before going anywhere.",
          "fr": "Ouais. Ouais, t'as raison. S'il y a des réponses ici, faut que je les trouve. Et j'ai besoin de plus de provisions avant d'aller où que ce soit."
        },
        {
          "en": "I found a stairwell leading down. It's dark as hell. I've got a flashlight but the batteries won't last forever.",
          "fr": "J'ai trouvé une cage d'escalier qui descend. C'est noir comme dans un four. J'ai une lampe torche mais les piles dureront pas éternellement."
        },
        {
          "en": "Okay, I'm going down. I'll message you when I find something. Or if something finds me.",
          "fr": "Bon, j'y vais. Je te message quand je trouve quelque chose. Ou si quelque chose me trouve."
        },
        {
          "en": "Wish me luck.",
          "fr": "Souhaite-moi bonne chance."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Be careful down there. I'll be right here.",
            "fr": "Fais attention là-dessous. Je bouge pas d'ici."
          },
          "next_node": "a1_facility_search",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Good luck. Try to find medicine if you can.",
            "fr": "Bonne chance. Essaie de trouver des médicaments si tu peux."
          },
          "next_node": "a1_facility_search",
          "flags_set": [
            "asked_for_medicine"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_kai_joins": {
      "id": "a2_kai_joins",
      "messages": [
        {
          "en": "He seems relieved. Like really relieved. I think he's been lonely for a long time.",
          "fr": "Il a l'air soulagé. Genre vraiment soulagé. Je crois qu'il était seul depuis longtemps."
        },
        {
          "en": "He shared some of his food with me. Dried meat, some nuts. Not bad. My supplies situation just got a lot better.",
          "fr": "Il a partagé un peu de sa nourriture avec moi. De la viande séchée, des noix. Pas mal. Ma situation de provisions s'améliore d'un coup."
        },
        {
          "en": "We're going to head north together. He knows a path through the forest that avoids the open areas.",
          "fr": "On va partir vers le nord ensemble. Il connaît un chemin à travers la forêt qui évite les zones découvertes."
        }
      ],
      "choices": [],
      "next_node": "a2_travel_day2",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_stayed_safe_aftermath": {
      "id": "a3_stayed_safe_aftermath",
      "messages": [
        {
          "en": "Dr. Osei offered me the keycard again. But I... I can't. After everything that just happened, I can't leave these people. Not now.",
          "fr": "Le Dr Osei m'a reproposé le badge. Mais je... je peux pas. Après tout ce qui vient de se passer, je peux pas laisser ces gens. Pas maintenant."
        },
        {
          "en": "She looked at me for a long time. Then she nodded. 'Then we wait,' she said. 'And we hope.'",
          "fr": "Elle m'a regardée longuement. Puis elle a hoché la tête. « Alors on attend », elle a dit. « Et on espère. »"
        },
        {
          "en": "I chose to stay. I chose safety. I chose these people over the mission.",
          "fr": "J'ai choisi de rester. J'ai choisi la sécurité. J'ai choisi ces gens plutôt que la mission."
        },
        {
          "en": "I hope it was the right call.",
          "fr": "J'espère que c'était le bon choix."
        }
      ],
      "choices": [],
      "next_node": "a5_static_buildup",
      "delay": 600,
      "ending": null,
      "trust_refusal": null
    },
    "a2_end": {
      "id": "a2_end",
      "messages": [
        {
          "en": "Good night. First real good night in three months.",
          "fr": "Bonne nuit. La première vraie bonne nuit en trois mois."
        }
      ],
      "choices": [],
      "next_node": "a3_morning",
      "delay": 300,
      "ending": null,
      "trust_refusal": null
    },
    "a2_day3_evening": {
      "id": "a2_day3_evening",
      "messages": [
        {
          "en": "The signal is definitely getting closer. I can feel it now — not just hear it. It's like a vibration in my chest.",
          "fr": "Le signal est clairement plus proche. Je le sens maintenant — pas juste l'entendre. C'est comme une vibration dans ma poitrine."
        },
        {
          "en": "The sky is doing that thing again. Flickering. Colors that shouldn't exist. It's beautiful in a terrifying way.",
          "fr": "Le ciel refait ce truc. Scintillement. Des couleurs qui devraient pas exister. C'est beau d'une façon terrifiante."
        },
        {
          "en": "I'm going to set up camp and try to sleep. Tomorrow should be the day I reach... whatever's sending that signal.",
          "fr": "Je vais monter le camp et essayer de dormir. Demain devrait être le jour où j'atteins... ce qui envoie ce signal."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Almost there. Stay strong, Elara.",
            "fr": "T'y es presque. Tiens bon, Elara."
          },
          "next_node": "a2_night_day3",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Be ready for anything tomorrow. Whatever's making that signal might not be friendly.",
            "fr": "Sois prête à tout demain. Ce qui émet ce signal est pas forcément amical."
          },
          "next_node": "a2_night_day3",
          "flags_set": [
            "warned_about_signal"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_escape_new_dawn": {
      "id": "a5_escape_new_dawn",
      "messages": [
        {
          "en": "I'm sitting on a hill, watching the world come back to life. And I'm crying. I'm crying and I can't stop.",
          "fr": "J'suis assise sur une colline, à regarder le monde revenir à la vie. Et je pleure. Je pleure et j'arrive pas à m'arrêter."
        }
      ],
      "choices": [],
      "next_node": "a5_ending_new_dawn",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_investigate_whispers": {
      "id": "a2_investigate_whispers",
      "messages": [
        {
          "en": "They're coming from... everywhere? No, wait. There's a direction. East. Toward what looks like an old church on a hill.",
          "fr": "Ils viennent de... partout ? Non, attends. Y'a une direction. L'est. Vers ce qui ressemble à une vieille église sur une colline."
        },
        {
          "en": "The air feels thick there. Electric. Like before a storm but... wrong.",
          "fr": "L'air est épais là-bas. Électrique. Comme avant un orage mais... pas normal."
        },
        {
          "en": "I'm not going in there. Just noting it. Something is very off about that place.",
          "fr": "J'y vais pas. Je note juste. Y'a un truc qui va vraiment pas avec cet endroit."
        }
      ],
      "choices": [],
      "next_node": "a2_resource_check",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_night": {
      "id": "a1_night",
      "messages": [
        {
          "en": "Good night. I'll message you in the morning.",
          "fr": "Bonne nuit. Je te message demain matin."
        }
      ],
      "choices": [],
      "next_node": "a2_morning",
      "delay": 600,
      "ending": null,
      "trust_refusal": null
    },
    "a2_resource_check": {
      "id": "a2_resource_check",
      "messages": [
        {
          "en": "Okay, stopping to take stock. It's getting dark and I need to eat something.",
          "fr": "Bon, je m'arrête pour faire le point. Il fait nuit et faut que je mange un truc."
        },
        {
          "en": "Food situation: I've got enough for maybe 3-4 days if I'm careful. Water's the bigger problem — I need to find a clean source.",
          "fr": "Situation nourriture : j'ai assez pour peut-être 3-4 jours si je fais gaffe. L'eau c'est le plus gros problème — faut que je trouve une source propre."
        },
        {
          "en": "I found an old gas station nearby. Might have supplies inside, but the door's jammed. I'd have to break in and it would make a lot of noise.",
          "fr": "J'ai trouvé une vieille station-service pas loin. Y'a peut-être des provisions dedans, mais la porte est coincée. Faudrait que je force l'entrée et ça ferait beaucoup de bruit."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Break in. You need the supplies. Deal with the noise.",
            "fr": "Force l'entrée. T'as besoin des provisions. Tant pis pour le bruit."
          },
          "next_node": "a2_break_in",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "supplies",
              2
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Too risky. Conserve what you have and keep moving at dawn.",
            "fr": "Trop risqué. Garde ce que t'as et repars à l'aube."
          },
          "next_node": "a2_conserve",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_osei_solution": {
      "id": "a3_osei_solution",
      "messages": [
        {
          "en": "She thinks so. Maybe. The resonance cascade is still running — that's what's causing the phenomena to get worse. If it could be shut down at the source...",
          "fr": "Elle pense que oui. Peut-être. La cascade de résonance tourne toujours — c'est ce qui fait empirer les phénomènes. Si on pouvait l'arrêter à la source..."
        },
        {
          "en": "The source is Helios. My facility. The one I just left. The locked door — Project MIROIR — that's where the equipment is.",
          "fr": "La source c'est Helios. Mon centre. Celui que je viens de quitter. La porte verrouillée — Projet MIROIR — c'est là que l'équipement est."
        },
        {
          "en": "She has a keycard. She kept it. She says if someone could get back there and shut down the resonance chamber, it might stop the cascade. Maybe even reverse it.",
          "fr": "Elle a un badge. Elle l'a gardé. Elle dit que si quelqu'un pouvait retourner là-bas et éteindre la chambre de résonance, ça pourrait arrêter la cascade. Peut-être même l'inverser."
        }
      ],
      "choices": [],
      "next_node": "a3_keycard_decision",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_osei_talk": {
      "id": "a3_osei_talk",
      "messages": [
        {
          "en": "I just had the most intense conversation of my life.",
          "fr": "Je viens d'avoir la conversation la plus intense de ma vie."
        },
        {
          "en": "Dr. Osei used to work for the same organization that funded Helios. She was at a sister facility — Project MIROIR was a joint operation.",
          "fr": "Le Dr Osei travaillait pour la même organisation qui finançait Helios. Elle était dans un centre partenaire — le Projet MIROIR était une opération conjointe."
        },
        {
          "en": "She says the Eshara wasn't natural. It was a resonance experiment that went catastrophically wrong. They were trying to open a... a gateway. To somewhere else.",
          "fr": "Elle dit que l'Eshara était pas naturel. C'était une expérience de résonance qui a catastrophiquement déraillé. Ils essayaient d'ouvrir un... un portail. Vers ailleurs."
        },
        {
          "en": "The 'changed' people? She thinks they're partially shifted into that other place. Not fully here anymore.",
          "fr": "Les gens 'changés' ? Elle pense qu'ils sont partiellement décalés vers cet autre endroit. Plus entièrement ici."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Can it be reversed? Is there a way to fix this?",
            "fr": "Est-ce qu'on peut inverser ça ? Y'a un moyen de réparer ?"
          },
          "next_node": "a3_osei_solution",
          "flags_set": [
            "asked_about_reversal"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "This is huge. Do the other survivors know?",
            "fr": "C'est énorme. Les autres survivants sont au courant ?"
          },
          "next_node": "a3_osei_secret",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_preparation": {
      "id": "a3_preparation",
      "messages": [
        {
          "en": "I'm spending today preparing. Dr. Osei is loading me up with supplies. Better food, water, a proper first aid kit.",
          "fr": "Je passe la journée à me préparer. Le Dr Osei me charge en provisions. De la meilleure nourriture, de l'eau, une vraie trousse de premiers soins."
        },
        {
          "en": "She also gave me something else. A weapon. An old hunting knife. 'Just in case,' she said.",
          "fr": "Elle m'a aussi donné autre chose. Une arme. Un vieux couteau de chasse. « Au cas où », elle a dit."
        }
      ],
      "choices": [],
      "next_node": "a3_day6",
      "delay": 180,
      "ending": null,
      "trust_refusal": null
    },
    "a3_talk_kai": {
      "id": "a3_talk_kai",
      "messages": [
        {
          "en": "I confronted him. Told him this wasn't who he had to be. That we traveled together, that he shared food with me.",
          "fr": "Je l'ai confronté. Je lui ai dit que c'était pas obligé d'être comme ça. Qu'on avait voyagé ensemble, qu'il avait partagé sa bouffe avec moi."
        },
        {
          "en": "He hesitated. I could see it in his eyes. Then his group leader called him back and the moment was gone.",
          "fr": "Il a hésité. Je l'ai vu dans ses yeux. Puis le chef de son groupe l'a rappelé et le moment est passé."
        },
        {
          "en": "But the delay was enough. Dr. Osei had time to rally the defenders. Kai's group backed off when they saw the rifles. For now.",
          "fr": "Mais le délai a suffi. Le Dr Osei a eu le temps de rallier les défenseurs. Le groupe de Kaï a reculé quand ils ont vu les fusils. Pour l'instant."
        }
      ],
      "choices": [],
      "next_node": "a3_aftermath",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_static_buildup": {
      "id": "a5_static_buildup",
      "messages": [
        {
          "en": "Days passed. The phenomena got worse. The sky was flickering constantly. The changed ones were everywhere.",
          "fr": "Les jours ont passé. Les phénomènes ont empiré. Le ciel scintillait sans arrêt. Les changés étaient partout."
        },
        {
          "en": "Then one night... everything just stopped. A massive flash, and then silence. The cascade burned itself out. Dr. Osei had been right — it was possible, but it took weeks more of suffering.",
          "fr": "Puis une nuit... tout s'est juste arrêté. Un flash massif, puis le silence. La cascade s'est épuisée. Le Dr Osei avait raison — c'était possible, mais ça a pris des semaines de souffrance en plus."
        },
        {
          "en": "But the flash fried the radio. This device. The one connecting us.",
          "fr": "Mais le flash a grillé la radio. Cet appareil. Celui qui nous connecte."
        }
      ],
      "choices": [],
      "next_node": "a5_ending_static",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_leave_lena": {
      "id": "a2_leave_lena",
      "messages": [
        {
          "en": "I... I kept walking. She called after me. I didn't turn around.",
          "fr": "J'ai... j'ai continué à marcher. Elle m'a appelée. Je me suis pas retournée."
        },
        {
          "en": "You're right. I know you're right. But I feel sick. This world is turning me into something I don't want to be.",
          "fr": "T'as raison. Je sais que t'as raison. Mais j'ai la nausée. Ce monde est en train de me transformer en quelque chose que je veux pas être."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_evening",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_escape_outcome": {
      "id": "a5_escape_outcome",
      "messages": [
        {
          "en": "I made it outside. Barely. The ground caved in behind me. The whole facility just... collapsed into itself.",
          "fr": "J'ai réussi à sortir. De justesse. Le sol s'est effondré derrière moi. Tout le centre s'est juste... effondré sur lui-même."
        },
        {
          "en": "The sky... the sky is clearing. The permanent twilight is lifting. I can see blue. Actual blue sky.",
          "fr": "Le ciel... le ciel s'éclaircit. Le crépuscule permanent se lève. Je vois du bleu. Du vrai ciel bleu."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "...",
            "fr": "..."
          },
          "next_node": "a5_eshara_buildup",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "FlagSet": "looked_into_rift"
            },
            {
              "StatBelow": [
                "morale",
                4
              ]
            }
          ]
        },
        {
          "label": {
            "en": "...",
            "fr": "..."
          },
          "next_node": "a5_gone_dark_buildup",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "StatBelow": [
                "health",
                4
              ]
            }
          ]
        },
        {
          "label": {
            "en": "...",
            "fr": "..."
          },
          "next_node": "a5_escape_new_dawn",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": "a5_escape_new_dawn",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_facility_discovery": {
      "id": "a1_facility_discovery",
      "messages": [
        {
          "en": "There's something else. I found a door with a keycard reader. Still has power somehow — there must be a backup generator somewhere.",
          "fr": "Y'a autre chose. J'ai trouvé une porte avec un lecteur de badge. Y'a encore du courant — y doit y avoir un générateur de secours quelque part."
        },
        {
          "en": "The sign on the door says 'Project MIROIR'. Whatever that is. I don't have the keycard though.",
          "fr": "Le panneau sur la porte dit « Projet MIROIR ». Quoi que ce soit. J'ai pas le badge par contre."
        },
        {
          "en": "I also found this weird thing. A notebook, handwritten. The last entry is dated the day of the Eshara. It says: 'The resonance cascade is accelerating. God help us all.'",
          "fr": "J'ai aussi trouvé un truc bizarre. Un carnet, écrit à la main. La dernière entrée date du jour de l'Eshara. Ça dit : « La cascade de résonance s'accélère. Que Dieu nous aide. »"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Resonance cascade? This might have started right there, in that facility.",
            "fr": "Cascade de résonance ? Ça a peut-être commencé là, dans ce centre."
          },
          "next_node": "a1_facility_reflect",
          "flags_set": [
            "suspects_facility"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Don't touch anything else. Get back to safety with what you found.",
            "fr": "Touche plus à rien. Remonte en sécurité avec ce que t'as trouvé."
          },
          "next_node": "a1_facility_reflect",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_continue_north": {
      "id": "a2_continue_north",
      "messages": [
        {
          "en": "Yeah, you're right. No distractions. The signal is the priority.",
          "fr": "Ouais, t'as raison. Pas de distractions. Le signal c'est la priorité."
        },
        {
          "en": "I'm pushing through. The terrain is getting rougher. More trees, but they're all dead. It's like walking through a graveyard of giants.",
          "fr": "Je continue. Le terrain devient plus difficile. Plus d'arbres, mais tous morts. C'est comme marcher dans un cimetière de géants."
        }
      ],
      "choices": [],
      "next_node": "a2_travel_day2",
      "delay": 180,
      "ending": null,
      "trust_refusal": null
    },
    "a1_head_north": {
      "id": "a1_head_north",
      "messages": [
        {
          "en": "The signal. Yeah. If there are people out there... that's worth more than anything I'd find in these ruins.",
          "fr": "Le signal. Ouais. S'il y a des gens là-bas... ça vaut plus que tout ce que je pourrais trouver dans ces ruines."
        },
        {
          "en": "I'll pack what I have. Some food, water, the flashlight. My jacket. It's not much.",
          "fr": "J'vais prendre ce que j'ai. Un peu de bouffe, de l'eau, la lampe. Mon blouson. C'est pas grand-chose."
        },
        {
          "en": "The terrain north of here is mostly open. Hills, dead forests. I should be able to see anyone coming from far away. That's good and bad.",
          "fr": "Le terrain au nord d'ici est surtout découvert. Des collines, des forêts mortes. Je devrais pouvoir voir quelqu'un arriver de loin. C'est bien et pas bien à la fois."
        },
        {
          "en": "Okay. I'm heading out. This is either the smartest or dumbest thing I've done.",
          "fr": "Bon. J'y vais. C'est soit le truc le plus intelligent soit le plus stupide que j'ai fait."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Stay on the high ground when you can. Easier to spot threats.",
            "fr": "Reste en hauteur quand tu peux. Plus facile de repérer les dangers."
          },
          "next_node": "a1_north_travel",
          "flags_set": [
            "tactical_advice"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Be brave. I believe in you.",
            "fr": "Sois courageuse. Je crois en toi."
          },
          "next_node": "a1_north_travel",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              2
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_osei_secret": {
      "id": "a3_osei_secret",
      "messages": [
        {
          "en": "No. She's kept it quiet. She says people here are barely holding on — if they found out it was man-made, it could tear the community apart.",
          "fr": "Non. Elle a gardé ça secret. Elle dit que les gens ici tiennent à peine — s'ils apprenaient que c'était artificiel, ça pourrait détruire la communauté."
        },
        {
          "en": "But she also said there might be a way to stop it. She has a keycard to the MIROIR lab at Helios. Someone would need to go back and shut down the resonance equipment.",
          "fr": "Mais elle a aussi dit qu'il y avait peut-être un moyen d'arrêter ça. Elle a un badge pour le labo MIROIR à Helios. Quelqu'un devrait retourner là-bas et éteindre l'équipement de résonance."
        }
      ],
      "choices": [],
      "next_node": "a3_keycard_decision",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a2_break_in": {
      "id": "a2_break_in",
      "messages": [
        {
          "en": "Okay, I found a rock and smashed the window. Loud as hell. My heart is pounding.",
          "fr": "Bon, j'ai trouvé une pierre et j'ai défoncé la vitre. Un boucan d'enfer. Mon cœur bat à fond."
        },
        {
          "en": "But it paid off. Bottled water, energy bars, and — oh thank god — a box of ibuprofen. My arm's been killing me.",
          "fr": "Mais ça a payé. De l'eau en bouteille, des barres énergétiques, et — oh dieu merci — une boîte d'ibuprofène. Mon bras me tuait."
        }
      ],
      "choices": [],
      "next_node": "a2_day3_morning",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "a4_timed_shutdown": {
      "id": "a4_timed_shutdown",
      "messages": [
        {
          "en": "The system has a delay option. I can set it for 5 minutes. That might be enough to get out of the building. Maybe.",
          "fr": "Le système a une option de délai. Je peux le régler sur 5 minutes. Ça pourrait suffire pour sortir du bâtiment. Peut-être."
        },
        {
          "en": "Setting the timer. Five minutes. Starting... now.",
          "fr": "Je règle le minuteur. Cinq minutes. C'est parti... maintenant."
        },
        {
          "en": "RUN.",
          "fr": "COURS."
        }
      ],
      "choices": [],
      "next_node": "a5_escape_run",
      "delay": 120,
      "ending": null,
      "trust_refusal": null
    },
    "a3_stay_safe": {
      "id": "a3_stay_safe",
      "messages": [
        {
          "en": "Yeah. Yeah, you're right. I almost died getting here. I can't just throw that away on a suicide mission.",
          "fr": "Ouais. Ouais, t'as raison. J'ai failli mourir en venant ici. Je peux pas gaspiller ça sur une mission suicide."
        },
        {
          "en": "Dr. Osei looked disappointed but she understood. She said she'd keep looking for another way.",
          "fr": "Le Dr Osei avait l'air déçue mais elle a compris. Elle dit qu'elle cherchera un autre moyen."
        }
      ],
      "choices": [],
      "next_node": "a3_day6",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_escape_run": {
      "id": "a5_escape_run",
      "messages": [
        {
          "en": "I'm running. The building is shaking. Chunks of ceiling are falling. The rift is screaming — a sound I'll never forget.",
          "fr": "Je cours. Le bâtiment tremble. Des morceaux de plafond tombent. La brèche hurle — un son que j'oublierai jamais."
        },
        {
          "en": "Stairs. Up. Up. My lungs are burning. I can hear the collapse starting behind me.",
          "fr": "Escaliers. En haut. En haut. Mes poumons brûlent. J'entends l'effondrement commencer derrière moi."
        }
      ],
      "choices": [],
      "next_node": "a5_escape_outcome",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_ending_static": {
      "id": "a5_ending_static",
      "messages": [
        {
          "en": "I'm alive. The settlement survived. We're rebuilding.",
          "fr": "J'suis vivante. La colonie a survécu. On reconstruit."
        },
        {
          "en": "But this radio is dying. I can hear the static getting louder. I don't know how much longer we have.",
          "fr": "Mais cette radio meurt. J'entends le grésillement qui monte. J'sais pas combien de temps il nous reste."
        },
        {
          "en": "Thank you. For everything. I'll be okay. I think.",
          "fr": "Merci. Pour tout. Ça va aller. Je crois."
        },
        {
          "en": "If you can hear this... if anyone can hear this... we're still here. We made it.",
          "fr": "Si tu m'entends... si quelqu'un m'entend... on est toujours là. On a survécu."
        },
        {
          "en": "* krrzzz... *",
          "fr": "* krrzzz... *"
        }
      ],
      "choices": [],
      "next_node": null,
      "delay": null,
      "ending": "Static",
      "trust_refusal": null
    },
    "a3_keycard_decision": {
      "id": "a3_keycard_decision",
      "messages": [
        {
          "en": "So here's the thing. She's offering me the keycard. She can't go herself — she's needed here to keep the settlement running.",
          "fr": "Alors voilà. Elle me propose le badge. Elle peut pas y aller elle-même — elle est indispensable ici pour faire tourner la colonie."
        },
        {
          "en": "Going back to Helios means days of travel through increasingly dangerous territory. Alone. To a facility I barely explored.",
          "fr": "Retourner à Helios veut dire des jours de voyage à travers un territoire de plus en plus dangereux. Seule. Vers un centre que j'ai à peine exploré."
        },
        {
          "en": "Or I could stay here. Safe. Alive. And hope the cascade burns itself out eventually.",
          "fr": "Ou je pourrais rester ici. En sécurité. En vie. Et espérer que la cascade s'épuise d'elle-même."
        },
        {
          "en": "What do you think?",
          "fr": "T'en penses quoi ?"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Take the keycard. If there's a chance to stop this, you have to try.",
            "fr": "Prends le badge. S'il y a une chance d'arrêter ça, faut que t'essaies."
          },
          "next_node": "a3_take_keycard",
          "flags_set": [
            "has_lab_keycard",
            "knows_truth"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Stay in the settlement. You're safe here. Don't risk your life.",
            "fr": "Reste dans la colonie. T'es en sécurité ici. Risque pas ta vie."
          },
          "next_node": "a3_stay_safe",
          "flags_set": [
            "knows_truth",
            "stayed_safe"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": {
        "min_trust": 3,
        "refusal_node": "a3_elara_decides_keycard",
        "refusal_message": {
          "en": "Look... I appreciate your input, but I need to think about this myself. This is too big for me to just follow someone else's call. Give me a moment.",
          "fr": "Écoute... j'apprécie ton avis, mais faut que j'y réfléchisse moi-même. C'est trop gros pour que je suive juste l'avis de quelqu'un d'autre. Laisse-moi un moment."
        }
      }
    },
    "a2_day3_morning": {
      "id": "a2_day3_morning",
      "messages": [
        {
          "en": "Day three. I'm making progress. The signal is getting stronger. I think I'm getting close.",
          "fr": "Troisième jour. J'avance. Le signal se renforce. Je crois que je m'approche."
        },
        {
          "en": "But... I just found something. There's a woman on the side of the road. She's hurt. Her leg is badly twisted — broken maybe. She's conscious but barely.",
          "fr": "Mais... je viens de trouver un truc. Y'a une femme au bord de la route. Elle est blessée. Sa jambe est tordue — cassée peut-être. Elle est consciente mais à peine."
        },
        {
          "en": "She's asking for help. She says her name is Lena, and she was trying to reach the northern signal too.",
          "fr": "Elle demande de l'aide. Elle dit qu'elle s'appelle Lena, et qu'elle essayait d'atteindre le signal du nord aussi."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Help her. Give her medicine and try to splint the leg.",
            "fr": "Aide-la. Donne-lui des médicaments et essaie d'éclisser la jambe."
          },
          "next_node": "a2_help_lena",
          "flags_set": [
            "helped_stranger"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "supplies",
              -1
            ],
            [
              "morale",
              2
            ],
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "You can't stop. It's too dangerous, and you don't have supplies to spare.",
            "fr": "Tu peux pas t'arrêter. C'est trop dangereux, et t'as pas de provisions en rab."
          },
          "next_node": "a2_leave_lena",
          "flags_set": [
            "left_stranger"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              -2
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Give her water and directions, but you can't carry her.",
            "fr": "Donne-lui de l'eau et des indications, mais tu peux pas la porter."
          },
          "next_node": "a2_partial_help",
          "flags_set": [
            "partial_help_stranger"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "supplies",
              -1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": {
        "min_trust": 2,
        "refusal_node": "a2_elara_helps_anyway",
        "refusal_message": {
          "en": "Sorry, but... I can't just leave her. I know you think it's too risky, but I can't walk past someone who's suffering. I'm going to help her.",
          "fr": "Désolée, mais... je peux pas juste la laisser. Je sais que tu trouves ça trop risqué, mais je peux pas passer à côté de quelqu'un qui souffre. Je vais l'aider."
        }
      }
    },
    "a3_one_more_night": {
      "id": "a3_one_more_night",
      "messages": [
        {
          "en": "One more night. I'll leave at first light.",
          "fr": "Une nuit de plus. Je pars aux premières lueurs."
        },
        {
          "en": "Dr. Osei went over the schematics with me again. I think I understand the system. Find the resonance chamber, shut down the primary oscillator, then seal the rift.",
          "fr": "Le Dr Osei a revu les schémas avec moi. Je crois que je comprends le système. Trouver la chambre de résonance, éteindre l'oscillateur primaire, puis sceller la brèche."
        },
        {
          "en": "'Seal the rift.' She said it like it was a normal thing to say.",
          "fr": "« Sceller la brèche. » Elle a dit ça comme si c'était un truc normal."
        }
      ],
      "choices": [],
      "next_node": "a3_day7",
      "delay": 180,
      "ending": null,
      "trust_refusal": null
    },
    "a4_console": {
      "id": "a4_console",
      "messages": [
        {
          "en": "I can see the control console. It's on the far side of the chamber, past the rift. The screens are still active, showing data I don't understand.",
          "fr": "Je vois la console de contrôle. Elle est de l'autre côté de la salle, au-delà de la brèche. Les écrans sont encore actifs, avec des données que je comprends pas."
        },
        {
          "en": "But there's a problem. The rift is between me and the console. I'd have to walk past it. Close to it.",
          "fr": "Mais y'a un problème. La brèche est entre moi et la console. Faudrait que je passe à côté. Près d'elle."
        },
        {
          "en": "I can feel it pulling at me. Not physically — it's like my thoughts are being tugged toward it. Like it wants me to look inside.",
          "fr": "Je la sens qui m'attire. Pas physiquement — c'est comme si mes pensées étaient tirées vers elle. Comme si elle voulait que je regarde à l'intérieur."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Don't look at it. Eyes on the console. Just get there.",
            "fr": "La regarde pas. Les yeux sur la console. Avance juste."
          },
          "next_node": "a4_approach_console",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Look into the rift. Maybe it will show you something useful.",
            "fr": "Regarde dans la brèche. Elle te montrera peut-être quelque chose d'utile."
          },
          "next_node": "a4_look_into_rift",
          "flags_set": [
            "looked_into_rift"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "health",
              -2
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": {
        "min_trust": 4,
        "refusal_node": "a4_look_into_rift",
        "refusal_message": {
          "en": "I know you said not to look but... I can't help it. It's like it's calling my name. I just need to see—",
          "fr": "Je sais que tu m'as dit de pas regarder mais... je peux pas m'en empêcher. C'est comme si ça appelait mon nom. Faut juste que je voie—"
        }
      }
    },
    "a4_look_into_rift": {
      "id": "a4_look_into_rift",
      "messages": [
        {
          "en": "I looked.",
          "fr": "J'ai regardé."
        },
        {
          "en": "I saw... I don't know how to describe it. Another place. Like here, but reflected. Twisted. The buildings were the same but made of something organic. Alive.",
          "fr": "J'ai vu... je sais pas comment le décrire. Un autre endroit. Comme ici, mais reflété. Tordu. Les bâtiments étaient les mêmes mais faits de quelque chose d'organique. Vivant."
        },
        {
          "en": "And the people. The vanished people. They're there. On the other side. Standing. Waiting.",
          "fr": "Et les gens. Les gens disparus. Ils sont là. De l'autre côté. Debout. En attente."
        },
        {
          "en": "I feel dizzy. My nose is bleeding. But I know something now that I didn't before.",
          "fr": "J'ai des vertiges. Mon nez saigne. Mais je sais quelque chose maintenant que je savais pas avant."
        }
      ],
      "choices": [],
      "next_node": "a4_approach_console",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_north_result": {
      "id": "a1_north_result",
      "messages": [
        {
          "en": "Hey. Still here. Still walking.",
          "fr": "Hé. Toujours là. Toujours en marche."
        },
        {
          "en": "The landscape is... it's eerie. Everything's grey. The trees are all dead but still standing, like skeletons. No birds, no insects. Just wind.",
          "fr": "Le paysage est... c'est flippant. Tout est gris. Les arbres sont tous morts mais encore debout, comme des squelettes. Pas d'oiseaux, pas d'insectes. Juste du vent."
        },
        {
          "en": "I found a road. There's an abandoned car with a map in the glove box. The map shows a town about 15 kilometers north. That might be where the signal's coming from.",
          "fr": "J'ai trouvé une route. Y'a une voiture abandonnée avec une carte dans la boîte à gants. La carte montre un village à environ 15 kilomètres au nord. C'est peut-être de là que vient le signal."
        },
        {
          "en": "It's getting dark though. I need to find shelter for the night.",
          "fr": "Mais il commence à faire nuit. Faut que je trouve un abri pour la nuit."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "The car could work as shelter. Lock the doors and stay low.",
            "fr": "La voiture pourrait servir d'abri. Verrouille les portes et reste discrète."
          },
          "next_node": "a1_north_shelter",
          "flags_set": [
            "slept_in_car"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Look for a building nearby. A car isn't safe if those 'changed' people show up.",
            "fr": "Cherche un bâtiment à proximité. Une voiture c'est pas sûr si les 'changés' débarquent."
          },
          "next_node": "a1_north_shelter",
          "flags_set": [
            "found_gas_station"
          ],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_north_travel": {
      "id": "a1_north_travel",
      "messages": [
        {
          "en": "I'll check in when I can. The signal might be spotty once I'm in the open.",
          "fr": "Je te recontacte quand je peux. Le signal sera peut-être instable une fois en terrain découvert."
        },
        {
          "en": "Here goes nothing.",
          "fr": "C'est parti pour rien. Ou pour tout."
        }
      ],
      "choices": [],
      "next_node": "a1_north_result",
      "delay": 300,
      "ending": null,
      "trust_refusal": null
    },
    "a2_meet_kai": {
      "id": "a2_meet_kai",
      "messages": [
        {
          "en": "Okay, I talked to him. His name is Kai. He's maybe early thirties, looks like he hasn't slept in weeks. Says he was a teacher before the Eshara.",
          "fr": "Bon, je lui ai parlé. Il s'appelle Kaï. La trentaine, on dirait qu'il a pas dormi depuis des semaines. Il dit qu'il était prof avant l'Eshara."
        },
        {
          "en": "He's been surviving alone too. Moving camp every few days to avoid the changed ones. He says they're getting more... organized.",
          "fr": "Lui aussi survit seul. Il déplace son camp tous les quelques jours pour éviter les changés. Il dit qu'ils deviennent plus... organisés."
        },
        {
          "en": "He's heard the northern signal too. Says he was heading that way but got spooked by something he saw near the river.",
          "fr": "Il a entendu le signal du nord aussi. Il dit qu'il allait dans cette direction mais qu'un truc qu'il a vu près de la rivière l'a fait flipper."
        },
        {
          "en": "He's asking if we should travel together. What do you think?",
          "fr": "Il demande si on devrait voyager ensemble. T'en penses quoi ?"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Yes, there's safety in numbers. Travel together.",
            "fr": "Oui, à deux c'est plus sûr. Voyagez ensemble."
          },
          "next_node": "a2_kai_joins",
          "flags_set": [
            "met_survivor_kai",
            "kai_ally"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Be careful. You don't know him. Keep your distance.",
            "fr": "Fais gaffe. Tu le connais pas. Garde tes distances."
          },
          "next_node": "a2_kai_separate",
          "flags_set": [
            "met_survivor_kai"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "trust_level",
              -1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_morning": {
      "id": "a3_morning",
      "messages": [
        {
          "en": "Morning. I actually slept. Like, really slept. I forgot what that felt like.",
          "fr": "Bonjour. J'ai vraiment dormi. Genre, vraiment. J'avais oublié ce que ça faisait."
        },
        {
          "en": "Dr. Osei wants to see me. She said it's urgent. Something about the Helios facility.",
          "fr": "Le Dr Osei veut me voir. Elle dit que c'est urgent. Un truc à propos du centre Helios."
        }
      ],
      "choices": [],
      "next_node": "a3_osei_talk",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_kai_confrontation": {
      "id": "a3_kai_confrontation",
      "messages": [
        {
          "en": "Dr. Osei is trying to negotiate. The settlement has weapons but they're outnumbered. This could get ugly fast.",
          "fr": "Le Dr Osei essaie de négocier. La colonie a des armes mais ils sont en infériorité numérique. Ça pourrait vite dégénérer."
        },
        {
          "en": "Kai saw me. He had the nerve to smile. Like we were old friends.",
          "fr": "Kaï m'a vue. Il a eu le culot de sourire. Comme si on était de vieux amis."
        }
      ],
      "choices": [
        {
          "label": {
            "en": "Try to talk to Kai directly. Appeal to whatever humanity he has left.",
            "fr": "Essaie de parler à Kaï directement. Fais appel à ce qui reste d'humanité en lui."
          },
          "next_node": "a3_talk_kai",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": [
            {
              "FlagSet": "kai_ally"
            }
          ]
        },
        {
          "label": {
            "en": "Help Dr. Osei defend the settlement. Stand your ground.",
            "fr": "Aide le Dr Osei à défendre la colonie. Tiens bon."
          },
          "next_node": "a3_defend",
          "flags_set": [],
          "flags_remove": [],
          "stat_changes": [],
          "conditions": []
        },
        {
          "label": {
            "en": "Use the chaos to slip away. You have a mission — get to Helios.",
            "fr": "Profite du chaos pour t'éclipser. T'as une mission — va à Helios."
          },
          "next_node": "a3_slip_away",
          "flags_set": [
            "abandoned_settlement"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              -2
            ]
          ],
          "conditions": [
            {
              "FlagSet": "has_lab_keycard"
            }
          ]
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_gone_dark_buildup": {
      "id": "a5_gone_dark_buildup",
      "messages": [
        {
          "en": "I'm... I'm not doing well. The escape took everything I had. I'm bleeding. I think something inside is broken.",
          "fr": "Je... je vais pas bien. La fuite m'a pris tout ce que j'avais. Je saigne. Je crois qu'un truc à l'intérieur est cassé."
        },
        {
          "en": "I made it out of the building but I can't walk anymore. I'm sitting against a tree, watching the sky clear.",
          "fr": "J'ai réussi à sortir du bâtiment mais je peux plus marcher. J'suis assise contre un arbre, à regarder le ciel s'éclaircir."
        },
        {
          "en": "At least it worked. The phenomena are stopping. That's something.",
          "fr": "Au moins ça a marché. Les phénomènes s'arrêtent. C'est déjà ça."
        }
      ],
      "choices": [],
      "next_node": "a5_ending_gone_dark",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a5_ending_eshara_wins": {
      "id": "a5_ending_eshara_wins",
      "messages": [
        {
          "en": "I can see it all now. Both sides. The membrane between worlds is so thin. So beautiful.",
          "fr": "Je vois tout maintenant. Les deux côtés. La membrane entre les mondes est si fine. Si belle."
        },
        {
          "en": "You should see what I see. You should feel what I feel. It's not an ending. It's a beginning.",
          "fr": "Tu devrais voir ce que je vois. Tu devrais sentir ce que je sens. C'est pas une fin. C'est un début."
        },
        {
          "en": "The Eshara isn't a catastrophe. It's an invitation.",
          "fr": "L'Eshara c'est pas une catastrophe. C'est une invitation."
        },
        {
          "en": "Come with me. Come with me. Come with me. Come with me. Come with me.",
          "fr": "Viens avec moi. Viens avec moi. Viens avec moi. Viens avec moi. Viens avec moi."
        },
        {
          "en": "* signal terminated *",
          "fr": "* signal terminé *"
        }
      ],
      "choices": [],
      "next_node": null,
      "delay": null,
      "ending": "TheEsharaWins",
      "trust_refusal": null
    },
    "a3_end": {
      "id": "a3_end",
      "messages": [
        {
          "en": "I need to rest. Tomorrow I should reach Helios. This time I'm going in with a plan.",
          "fr": "Faut que je me repose. Demain je devrais atteindre Helios. Cette fois j'y vais avec un plan."
        },
        {
          "en": "Talk tomorrow. I hope.",
          "fr": "On se parle demain. J'espère."
        }
      ],
      "choices": [],
      "next_node": "a4_arrival",
      "delay": 300,
      "ending": null,
      "trust_refusal": null
    },
    "a2_enter_town": {
      "id": "a2_enter_town",
      "messages": [
        {
          "en": "I'm in. They saw me coming and a group met me at the entrance. They were cautious but not hostile.",
          "fr": "J'y suis. Ils m'ont vue arriver et un groupe m'a accueillie à l'entrée. Méfiants mais pas hostiles."
        },
        {
          "en": "The leader is a woman named Dr. Osei. She's a physicist. She says they've been gathering survivors and trying to understand what the Eshara is.",
          "fr": "La cheffe est une femme appelée Dr Osei. C'est une physicienne. Elle dit qu'ils rassemblent des survivants et essaient de comprendre ce qu'est l'Eshara."
        },
        {
          "en": "She says they have a working generator, food production, and defenses. But she also says the phenomena are getting worse. The flickering is more frequent. The changed ones are moving in patterns now.",
          "fr": "Elle dit qu'ils ont un générateur, de la production de nourriture, et des défenses. Mais elle dit aussi que les phénomènes empirent. Les scintillements sont plus fréquents. Les changés se déplacent en schémas maintenant."
        },
        {
          "en": "She asked where I came from. When I mentioned the Helios facility, her face changed. She wants to talk more tomorrow.",
          "fr": "Elle a demandé d'où je venais. Quand j'ai mentionné le centre Helios, son visage a changé. Elle veut en reparler demain."
        },
        {
          "en": "They gave me a real bed. With blankets. I almost cried.",
          "fr": "Ils m'ont donné un vrai lit. Avec des couvertures. J'ai failli pleurer."
        },
        {
          "en": "I'm safe for now. Going to sleep. Talk tomorrow?",
          "fr": "J'suis en sécurité pour le moment. Je vais dormir. On se parle demain ?"
        }
      ],
      "choices": [
        {
          "label": {
            "en": "You made it. Sleep well, Elara. You deserve this.",
            "fr": "T'as réussi. Dors bien, Elara. Tu le mérites."
          },
          "next_node": "a2_end",
          "flags_set": [
            "reached_settlement"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              2
            ],
            [
              "health",
              1
            ],
            [
              "trust_level",
              1
            ]
          ],
          "conditions": []
        },
        {
          "label": {
            "en": "Good work finding them. But be careful — we don't know their full story yet.",
            "fr": "Bien joué de les avoir trouvés. Mais fais gaffe — on connaît pas toute leur histoire encore."
          },
          "next_node": "a2_end",
          "flags_set": [
            "reached_settlement",
            "cautious_about_settlement"
          ],
          "flags_remove": [],
          "stat_changes": [
            [
              "morale",
              1
            ],
            [
              "health",
              1
            ]
          ],
          "conditions": []
        }
      ],
      "next_node": null,
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a3_take_keycard": {
      "id": "a3_take_keycard",
      "messages": [
        {
          "en": "You're right. If there's even a small chance... I have to try. For everyone.",
          "fr": "T'as raison. S'il y a ne serait-ce qu'une petite chance... faut que j'essaie. Pour tout le monde."
        },
        {
          "en": "Dr. Osei gave me the keycard and a rough schematic of the MIROIR lab. She thinks the main control console is in the deepest chamber.",
          "fr": "Le Dr Osei m'a donné le badge et un schéma approximatif du labo MIROIR. Elle pense que la console principale est dans la salle la plus profonde."
        }
      ],
      "choices": [],
      "next_node": "a3_preparation",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    },
    "a1_response_direct": {
      "id": "a1_response_direct",
      "messages": [
        {
          "en": "Right, yeah. Helios Research Facility. It was some kind of government-funded lab. Biotech, physics, weird stuff I never fully understood.",
          "fr": "Ouais, le Centre de Recherche Helios. C'était un genre de labo financé par le gouvernement. Biotech, physique, des trucs bizarres que j'ai jamais vraiment compris."
        },
        {
          "en": "I was an engineer here. Mechanical systems, infrastructure. Not the secret science stuff.",
          "fr": "Moi j'étais ingénieure ici. Systèmes mécaniques, infrastructure. Pas les trucs scientifiques secrets."
        },
        {
          "en": "Then about three months ago... the Eshara happened. That's what people called it before the broadcasts stopped.",
          "fr": "Et puis y'a environ trois mois... l'Eshara s'est produit. C'est comme ça que les gens l'appelaient avant que les émissions s'arrêtent."
        }
      ],
      "choices": [],
      "next_node": "a1_eshara_explain",
      "delay": null,
      "ending": null,
      "trust_refusal": null
    }
  },
  "endings": {
    "TheSignal": {
      "title": {
        "en": "The Signal",
        "fr": "Le Signal"
      },
      "description": {
        "en": "Elara managed to reverse the Eshara, but at great personal cost.",
        "fr": "Elara a réussi à inverser l'Eshara, mais à un prix terrible."
      }
    },
    "Static": {
      "title": {
        "en": "Static",
        "fr": "Grésillement"
      },
      "description": {
        "en": "Elara survived, but the radio broke. Her last words: \"Thank you. For everything. I'll be okay. I think.\"",
        "fr": "Elara a survécu, mais la radio a lâché. Ses derniers mots : « Merci. Pour tout. Ça va aller. Je crois. »"
      }
    },
    "TheEsharaWins": {
      "title": {
        "en": "The Eshara Wins",
        "fr": "L'Eshara Triomphe"
      },
      "description": {
        "en": "Elara was consumed by the phenomena. Her last messages became... wrong.",
        "fr": "Elara a été absorbée par les phénomènes. Ses derniers messages sont devenus... étranges."
      }
    },
    "GoneDark": {
      "title": {
        "en": "Gone Dark",
        "fr": "Signal Perdu"
      },
      "description": {
        "en": "Elara didn't make it. The radio went silent.",
        "fr": "Elara n'a pas survécu. La radio s'est tue."
      }
    },
    "NewDawn": {
      "title": {
        "en": "New Dawn",
        "fr": "Aube Nouvelle"
      },
      "description": {
        "en": "Elara found the safe zone. Your guidance saved her. There is hope.",
        "fr": "Elara a trouvé la zone sûre. Tes conseils l'ont sauvée. Il y a de l'espoir."
      }
    }
  }
}