{
  "meta": {
    "title": "Eshara",
    "version": "1.0",
    "start_node": "a1_first_contact",
    "default_typing_delay_ms": 60,
    "debug_delay_override_seconds": 5
  },
  "stats": {
    "trust": { "initial": 3, "min": 0, "max": 10, "description": "Elara's trust in the player" },
    "health": { "initial": 10, "min": 0, "max": 10, "description": "Elara's physical condition. 0 = death." },
    "supplies": { "initial": 3, "min": 0, "max": 10, "description": "Food, water, materials." }
  },
  "flags": {
    "encouraged_departure": "Player encouraged Elara to go in Act 1",
    "searched_warehouse": "Risky scavenge in Act 1 — better loot but minor injury",
    "has_shielding": "Found shielding material (warehouse or under overpass)",
    "has_medicine": "Found medical supplies (under overpass or failsafe settlement)",
    "has_facility_records": "Found partial facility data (over overpass)",
    "sheltered_first_pulse": "Chose shelter during first pulse",
    "went_over_overpass": "Took the exposed route over the overpass",
    "went_under_overpass": "Took the tunnel route under the overpass",
    "pushed_autonomy": "Player encouraged Elara to make her own decisions",
    "lina_asked": "Player asked about Lina during dust storm",
    "entity_move_failed": "Failed the night entity escape attempt",
    "doubt_honest": "Responded honestly to Elara's doubt",
    "doubt_reassure": "Reassured Elara during doubt",
    "doubt_deflect": "Deflected Elara's doubt",
    "chose_direct_path": "Going straight to facility",
    "chose_failsafe": "Detoured to failsafe terminal",
    "failsafe_succeeded": "Remote shutdown signal sent",
    "failsafe_failed": "Failsafe terminal couldn't complete shutdown",
    "lina_opened_up": "Elara talked about Lina openly (failsafe path)",
    "entered_main": "Entered facility through main entrance",
    "entered_tunnel": "Entered facility through service tunnel",
    "vasik_badge": "Picked up Dr. Vasik's ID badge"
  },
  "endings": {
    "still_here": {
      "title": { "en": "Still Here", "fr": "Encore là" },
      "type": "good",
      "conditions": { "min_trust": 8, "min_health": 7, "flags_required": ["emitter_shutdown"] }
    },
    "let_go": {
      "title": { "en": "Let Go", "fr": "Lâcher prise" },
      "type": "good",
      "conditions": { "min_trust": 5, "min_health": 3, "flags_required": ["emitter_shutdown"] }
    },
    "static": {
      "title": { "en": "Static", "fr": "Parasite" },
      "type": "bittersweet",
      "conditions": { "flags_required": ["radio_sacrificed"] }
    },
    "gone_dark": {
      "title": { "en": "Gone Dark", "fr": "Signal perdu" },
      "type": "bad",
      "conditions": { "health_equals": 0 }
    },
    "echo": {
      "title": { "en": "Echo", "fr": "Écho" },
      "type": "bad",
      "conditions": { "max_trust": 4, "min_health": 1 }
    }
  },
  "nodes": {

    "a1_first_contact": {
      "id": "a1_first_contact",
      "act": 1,
      "title": "First radio contact",
      "messages": [
        { "en": "Hello?", "fr": "Allô ?" },
        { "en": "Is this... is someone there?", "fr": "C'est... y'a quelqu'un ?" },
        { "en": "Oh god.", "fr": "Oh putain." },
        { "en": "Oh god, it works. You're there. Someone is actually there.", "fr": "Oh putain, ça marche. T'es là. Y'a vraiment quelqu'un." },
        { "en": "Sorry. Sorry. I'm shaking. Give me a second.", "fr": "Pardon. Pardon. Je tremble. Donne-moi une seconde." },
        { "en": "I haven't talked to anyone in three months.", "fr": "J'ai parlé à personne depuis trois mois." },
        { "en": "Three months. I've been counting.", "fr": "Trois mois. J'ai compté." },
        { "en": "My name is Elara. I'm... I'm an engineer. Or I was. I don't know what I am now.", "fr": "Je m'appelle Elara. Je suis... j'suis ingénieure. Ou j'étais. J'sais plus trop ce que j'suis maintenant." },
        { "en": "I built this radio from a dead tablet and some wire I pulled from a relay box. Took me three weeks.", "fr": "J'ai fabriqué cette radio avec une tablette morte et du fil que j'ai arraché d'un boîtier relais. Ça m'a pris trois semaines." },
        { "en": "I didn't actually think it would reach anyone.", "fr": "J'pensais vraiment pas que ça capterait qui que ce soit." }
      ],
      "choices": null,
      "next_node": "a1_oriented",
      "delay": null,
      "on_enter": null
    },

    "a1_oriented": {
      "id": "a1_oriented",
      "act": 1,
      "title": "World explanation",
      "messages": [
        { "en": "You know what happened, right? The Eshara?", "fr": "Tu sais ce qui s'est passé, hein ? L'Eshara ?" },
        { "en": "Three months ago. The frequency. Everything just... stopped.", "fr": "Y'a trois mois. La fréquence. Tout s'est juste... arrêté." },
        { "en": "Most people died in hours. I don't know why I didn't.", "fr": "La plupart des gens sont morts en quelques heures. J'sais pas pourquoi pas moi." },
        { "en": "I'm in a scrap settlement. Or what's left of one. Metal walls, dust, silence.", "fr": "J'suis dans un campement de ferraille. Ou ce qu'il en reste. Des murs en métal, de la poussière, du silence." },
        { "en": "And there's this... facility. On the horizon. Huge. You can see it from anywhere.", "fr": "Et y'a cette... installation. À l'horizon. Énorme. On la voit de partout." },
        { "en": "I found schematics in an old terminal. The frequency comes from there. And it can be shut down.", "fr": "J'ai trouvé des schémas dans un vieux terminal. La fréquence vient de là-bas. Et on peut l'arrêter." },
        { "en": "Manually. From the inside.", "fr": "Manuellement. De l'intérieur." },
        { "en": "I've been staring at that thing every morning for weeks. Waiting for a reason to go.", "fr": "Ça fait des semaines que je fixe ce truc chaque matin. En attendant une raison d'y aller." },
        { "en": "Maybe you're it.", "fr": "T'es peut-être cette raison." }
      ],
      "choices": [
        {
          "label": { "en": "You should go. If there's a chance to stop it, you have to try.", "fr": "Tu devrais y aller. S'il y a une chance d'arrêter ça, faut essayer." },
          "next_node": "a1_encouraged",
          "on_choose": { "trust_change": 1, "flags_set": ["encouraged_departure"] }
        },
        {
          "label": { "en": "That sounds incredibly dangerous. Maybe you should stay where it's safe.", "fr": "Ça a l'air incroyablement dangereux. Tu devrais peut-être rester où c'est sûr." },
          "next_node": "a1_stay_safe",
          "on_choose": { "trust_change": 0 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a1_encouraged": {
      "id": "a1_encouraged",
      "act": 1,
      "title": "Player encourages departure",
      "messages": [
        { "en": "Yeah.", "fr": "Ouais." },
        { "en": "Yeah, you're right. I know you're right.", "fr": "Ouais, t'as raison. Je sais que t'as raison." },
        { "en": "I think I just needed someone to say it.", "fr": "Je crois que j'avais juste besoin que quelqu'un le dise." },
        { "en": "Okay. I'll go. But first I need supplies. This settlement has some buildings I haven't searched yet.", "fr": "Ok. J'y vais. Mais d'abord faut que je trouve des provisions. Y'a des bâtiments dans le campement que j'ai pas encore fouillés." }
      ],
      "choices": null,
      "next_node": "a1_prep_choice",
      "delay": null,
      "on_enter": null
    },

    "a1_stay_safe": {
      "id": "a1_stay_safe",
      "act": 1,
      "title": "Player advises caution",
      "messages": [
        { "en": "Safe.", "fr": "Sûr." },
        { "en": "Where exactly is safe? Here? With the pulses getting worse and my supplies running out?", "fr": "Où exactement c'est sûr ? Ici ? Avec les impulsions qui empirent et mes provisions qui s'épuisent ?" },
        { "en": "I appreciate the concern. I do. But staying is just dying slower.", "fr": "J'apprécie l'inquiétude. Vraiment. Mais rester c'est juste mourir plus lentement." },
        { "en": "I'm going. But first I need to scavenge some supplies.", "fr": "J'y vais. Mais d'abord faut que je récupère des provisions." }
      ],
      "choices": null,
      "next_node": "a1_prep_choice",
      "delay": null,
      "on_enter": null
    },

    "a1_prep_choice": {
      "id": "a1_prep_choice",
      "act": 1,
      "title": "Scavenging choice",
      "messages": [
        { "en": "There's two options.", "fr": "Y'a deux possibilités." },
        { "en": "The outer buildings are picked pretty clean but I can probably find some rations. Safe enough.", "fr": "Les bâtiments extérieurs sont déjà bien vidés mais je peux sûrement trouver des rations. Assez sûr." },
        { "en": "Or there's the old warehouse. Half collapsed. I've been avoiding it because the structure looks... unreliable.", "fr": "Ou y'a l'ancien entrepôt. À moitié effondré. Je l'ai évité parce que la structure a l'air... instable." },
        { "en": "But if anything good is left in this place, it's in there.", "fr": "Mais s'il reste quelque chose de bien ici, c'est là-dedans." }
      ],
      "choices": [
        {
          "label": { "en": "Try the warehouse. If you're heading to the facility, you'll need the best supplies you can find.", "fr": "Tente l'entrepôt. Si tu vas jusqu'à l'installation, il te faut les meilleures provisions possibles." },
          "next_node": "a1_warehouse",
          "on_choose": { "flags_set": ["searched_warehouse"] }
        },
        {
          "label": { "en": "Stick to the safe buildings. Don't risk getting hurt before the journey even starts.", "fr": "Reste dans les bâtiments sûrs. Te blesse pas avant même de partir." },
          "next_node": "a1_safe_scavenge",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a1_warehouse": {
      "id": "a1_warehouse",
      "act": 1,
      "title": "Warehouse scavenging — risky",
      "messages": [
        { "en": "Alright. Going in.", "fr": "Ok. J'y vais." },
        { "en": "...", "fr": "..." },
        { "en": "Okay, it's darker than I expected. The roof is holding but I can hear it creaking.", "fr": "Ok, c'est plus sombre que je pensais. Le toit tient mais je l'entends grincer." },
        { "en": "Wait. There's a storage cage in the back. Still sealed.", "fr": "Attends. Y'a une cage de stockage au fond. Encore scellée." },
        { "en": "Jackpot. Rations, water purification tablets, a first aid kit, and... oh hello.", "fr": "Bingo. Des rations, des pastilles de purification, une trousse de secours, et... oh bonjour." },
        { "en": "Some kind of insulating mesh. Looks like it was meant for signal shielding. Might help with the pulses.", "fr": "Une espèce de maille isolante. On dirait que c'était fait pour le blindage de signal. Ça pourrait aider avec les impulsions." },
        { "en": "SHIT", "fr": "MERDE" },
        { "en": "A beam just came down. I'm fine. Mostly. My arm caught the edge.", "fr": "Une poutre vient de tomber. Ça va. À peu près. Mon bras a pris le bord." },
        { "en": "It's not deep. Just bleeding a lot. I'll wrap it.", "fr": "C'est pas profond. Ça saigne juste beaucoup. Je vais bander ça." },
        { "en": "Worth it though. This shielding mesh could save my life out there.", "fr": "Ça valait le coup quand même. Cette maille de blindage pourrait me sauver la vie là-bas." }
      ],
      "choices": null,
      "next_node": "a1_first_night",
      "delay": { "seconds": 300, "message": { "en": "Elara is patching up her arm and packing supplies.", "fr": "Elara soigne son bras et prépare ses affaires." } },
      "on_enter": { "health_change": -1, "supplies_change": 3, "flags_set": ["has_shielding"] }
    },

    "a1_safe_scavenge": {
      "id": "a1_safe_scavenge",
      "act": 1,
      "title": "Safe scavenging",
      "messages": [
        { "en": "Smart. No point getting hurt before I even start.", "fr": "Malin. Ça sert à rien de se blesser avant même de commencer." },
        { "en": "The outer buildings are pretty bare. Some rations, a dented canteen, half a roll of bandages.", "fr": "Les bâtiments extérieurs sont assez vides. Des rations, une gourde cabossée, un demi-rouleau de bandages." },
        { "en": "Not much. But it's something.", "fr": "Pas grand-chose. Mais c'est mieux que rien." },
        { "en": "Found something weird though. In what I think was a kid's room.", "fr": "J'ai trouvé un truc bizarre par contre. Dans ce qui devait être une chambre d'enfant." },
        { "en": "A little toy robot. Metal. Hand-painted. Someone made this.", "fr": "Un petit robot jouet. En métal. Peint à la main. Quelqu'un a fabriqué ça." },
        { "en": "I put it in my pocket. Don't ask me why.", "fr": "Je l'ai mis dans ma poche. Me demande pas pourquoi." }
      ],
      "choices": null,
      "next_node": "a1_first_night",
      "delay": { "seconds": 180, "message": { "en": "Elara is packing up supplies.", "fr": "Elara prépare ses affaires." } },
      "on_enter": { "supplies_change": 1 }
    },

    "a1_first_night": {
      "id": "a1_first_night",
      "act": 1,
      "title": "First night — settling in",
      "messages": [
        { "en": "Found a spot for the night. Walls on three sides, roof overhead. Five stars. Would apocalypse again.", "fr": "J'ai trouvé un coin pour la nuit. Des murs sur trois côtés, un toit au-dessus. Cinq étoiles. Je recommande l'apocalypse." },
        { "en": "The sun is going down. The sky gets weird at dusk — kind of flickers, like a bad signal.", "fr": "Le soleil se couche. Le ciel devient bizarre au crépuscule — ça scintille un peu, comme un mauvais signal." },
        { "en": "I've gotten used to most things. The emptiness. The dust. The silence.", "fr": "Je me suis habituée à la plupart des trucs. Le vide. La poussière. Le silence." },
        { "en": "But I never got used to the silence at night. That's when it really hits.", "fr": "Mais je me suis jamais habituée au silence la nuit. C'est là que ça frappe vraiment." },
        { "en": "You know the worst part? It's not the quiet. It's the almost-sounds. The hum from the ground. The way the air vibrates sometimes.", "fr": "Tu sais le pire ? C'est pas le calme. C'est les presque-sons. Le bourdonnement du sol. La façon dont l'air vibre parfois." },
        { "en": "Like the world is trying to say something but the words are all wrong.", "fr": "Comme si le monde essayait de dire quelque chose mais que les mots étaient tous faux." },
        { "en": "...", "fr": "..." },
        { "en": "I keep humming this stupid song. Can't get it out of my head. It's not even a good melody.", "fr": "J'arrête pas de fredonner une chanson débile. J'arrive pas à me la sortir de la tête. C'est même pas une bonne mélodie." },
        { "en": "Anyway. I'm going to try to sleep. Leaving at dawn.", "fr": "Bref. Je vais essayer de dormir. Je pars à l'aube." },
        { "en": "Hey.", "fr": "Hé." },
        { "en": "Thanks for being there. I mean it.", "fr": "Merci d'être là. Sincèrement." },
        { "en": "Talk tomorrow.", "fr": "On se parle demain." }
      ],
      "choices": null,
      "next_node": "a2_departure",
      "delay": { "seconds": 25200, "message": { "en": "Elara is sleeping. She'll be back at dawn.", "fr": "Elara dort. Elle reviendra à l'aube." } },
      "on_enter": null
    },

    "a2_departure": {
      "id": "a2_departure",
      "act": 2,
      "title": "Morning departure",
      "messages": [
        { "en": "Morning.", "fr": "Bonjour." },
        { "en": "Didn't sleep great. Dreamed about the bus. You know, the morning commute. Completely normal dream.", "fr": "J'ai pas super bien dormi. J'ai rêvé du bus. Tu sais, le trajet du matin. Un rêve complètement normal." },
        { "en": "Those are the worst kind.", "fr": "C'est le pire genre de rêve." },
        { "en": "Anyway. I'm packed. I'm going.", "fr": "Bref. J'suis prête. J'y vais." },
        { "en": "The facility looks closer this morning. Might be wishful thinking.", "fr": "L'installation a l'air plus proche ce matin. C'est sûrement juste dans ma tête." },
        { "en": "I'll check in as I walk. Keep me company?", "fr": "Je te donne des nouvelles en marchant. Tu me tiens compagnie ?" }
      ],
      "choices": null,
      "next_node": "a2_walking",
      "delay": { "seconds": 900, "message": { "en": "Elara is walking.", "fr": "Elara marche." } },
      "on_enter": null
    },

    "a2_walking": {
      "id": "a2_walking",
      "act": 2,
      "title": "Walking — landscape description",
      "messages": [
        { "en": "You ever seen a highway with no cars? Just... empty. Goes on forever.", "fr": "T'as déjà vu une autoroute sans voitures ? Juste... vide. Ça continue à l'infini." },
        { "en": "It's almost beautiful if you don't think about why.", "fr": "C'est presque beau si tu penses pas au pourquoi." },
        { "en": "There's a pipeline to my left, half buried in sand. And these towers in the distance — skeletal, all the panels stripped.", "fr": "Y'a un pipeline à ma gauche, à moitié enfoui dans le sable. Et ces tours au loin — squelettiques, tous les panneaux arrachés." },
        { "en": "The world didn't fall apart all at once. It was already pretty beaten up before the Eshara. We just finished the job.", "fr": "Le monde s'est pas effondré d'un coup. Il était déjà bien amoché avant l'Eshara. On a juste fini le travail." },
        { "en": "Hold on. Something's happening.", "fr": "Attends. Y'a un truc qui se passe." }
      ],
      "choices": null,
      "next_node": "a2_first_pulse",
      "delay": null,
      "on_enter": null
    },

    "a2_first_pulse": {
      "id": "a2_first_pulse",
      "act": 2,
      "title": "First pulse encounter",
      "messages": [
        { "en": "Pressure. In my skull. You know when you dive too deep in water? Like that, but everywhere.", "fr": "De la pression. Dans mon crâne. Tu sais quand tu plonges trop profond ? Comme ça, mais partout." },
        { "en": "My teeth are buzzing. That's the frequency.", "fr": "Mes dents vibrent. C'est la fréquence." },
        { "en": "Nose is bleeding. Hang on.", "fr": "Mon nez saigne. Attends." },
        { "en": "The air just... shimmered. Like heat off asphalt but it's freezing.", "fr": "L'air vient de... onduler. Comme de la chaleur au-dessus du bitume sauf qu'il fait un froid de dingue." },
        { "en": "I can see shapes. At the edge. Don't look directly — they move when you look away.", "fr": "Je vois des formes. En périphérie. Regarde pas directement — elles bougent quand tu détournes le regard." },
        { "en": "What do I do?", "fr": "Je fais quoi ?" }
      ],
      "choices": [
        {
          "label": { "en": "Find shelter. Now. Get behind something solid and wait it out.", "fr": "Trouve un abri. Maintenant. Mets-toi derrière quelque chose de solide et attends que ça passe." },
          "next_node": "a2_pulse_shelter",
          "on_choose": { "trust_change": 1, "flags_set": ["sheltered_first_pulse"] }
        },
        {
          "label": { "en": "Keep moving. It seems mild. Push through before it gets worse.", "fr": "Continue d'avancer. Ça a l'air léger. Avance avant que ça empire." },
          "next_node": "a2_pulse_push",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_pulse_shelter": {
      "id": "a2_pulse_shelter",
      "act": 2,
      "title": "Sheltered during first pulse",
      "messages": [
        { "en": "Found an overturned vehicle. Crawling under.", "fr": "J'ai trouvé un véhicule retourné. Je rampe dessous." },
        { "en": "...", "fr": "..." },
        { "en": "Okay. I'm under. The metal helps — the pressure is less.", "fr": "Ok. J'suis dessous. Le métal aide — la pression est moindre." },
        { "en": "I can hear them. The entities. Like static through a broken speaker, but moving. Overhead.", "fr": "Je les entends. Les entités. Comme du grésil dans un haut-parleur cassé, mais en mouvement. Au-dessus." },
        { "en": "They don't seem to notice me.", "fr": "Elles ont pas l'air de me remarquer." },
        { "en": "...", "fr": "..." },
        { "en": "It's passing. The pressure is lifting.", "fr": "Ça passe. La pression se relâche." },
        { "en": "Good call. That could've been bad.", "fr": "Bon réflexe. Ça aurait pu mal tourner." }
      ],
      "choices": null,
      "next_node": "a2_overpass_approach",
      "delay": { "seconds": 600, "message": { "en": "Elara is waiting for the pulse to pass.", "fr": "Elara attend que l'impulsion passe." } },
      "on_enter": { "health_change": -1 }
    },

    "a2_pulse_push": {
      "id": "a2_pulse_push",
      "act": 2,
      "title": "Pushed through first pulse",
      "messages": [
        { "en": "Okay. Walking. Walking through it.", "fr": "Ok. Je marche. Je marche à travers." },
        { "en": "It's getting worse. The shapes are clearer now. Tall. Thin. Like static given a spine.", "fr": "Ça empire. Les formes sont plus nettes maintenant. Grandes. Fines. Comme du grésil avec une colonne vertébrale." },
        { "en": "My vision keeps", "fr": "Ma vision arrête pas de" },
        { "en": "Sorry. Dizzy.", "fr": "Pardon. Vertige." },
        { "en": "I'm through. I think I'm through. It's fading.", "fr": "J'suis passée. Je crois que j'suis passée. Ça s'estompe." },
        { "en": "That was... not great. My nose won't stop bleeding. My hands are shaking.", "fr": "C'était... pas top. Mon nez arrête pas de saigner. Mes mains tremblent." },
        { "en": "But I covered a lot of ground.", "fr": "Mais j'ai bien avancé." },
        { "en": "Let's not do that again.", "fr": "On refait pas ça." }
      ],
      "choices": null,
      "next_node": "a2_overpass_approach",
      "delay": { "seconds": 300, "message": { "en": "Elara is recovering.", "fr": "Elara récupère." } },
      "on_enter": { "health_change": -3 }
    },

    "a2_overpass_approach": {
      "id": "a2_overpass_approach",
      "act": 2,
      "title": "Reaching the overpass",
      "messages": [
        { "en": "There's a massive overpass ahead. Old megastructure. Half of it collapsed into the desert.", "fr": "Y'a un énorme viaduc devant moi. Ancienne mégastructure. La moitié s'est effondrée dans le désert." },
        { "en": "It's blocking my path. I can't go around — it stretches too far.", "fr": "Il bloque mon chemin. Je peux pas contourner — ça s'étend trop loin." },
        { "en": "Two options.", "fr": "Deux options." },
        { "en": "I can climb over. It's exposed — no cover if a pulse hits. But I'd be able to see for kilometers from up there. And it's faster.", "fr": "Je peux passer par-dessus. C'est exposé — pas d'abri si une impulsion frappe. Mais je verrais à des kilomètres de là-haut. Et c'est plus rapide." },
        { "en": "Or I go under. There's a maintenance tunnel. Sheltered from pulses, probably. But dark. And the acoustics in there are... wrong. I can hear echoes that don't match my footsteps.", "fr": "Ou je passe par-dessous. Y'a un tunnel de maintenance. À l'abri des impulsions, probablement. Mais sombre. Et l'acoustique là-dedans est... bizarre. J'entends des échos qui correspondent pas à mes pas." }
      ],
      "choices": [
        {
          "label": { "en": "Go over. The view could be valuable, and you need to make good time.", "fr": "Passe par-dessus. La vue pourrait être utile, et tu dois avancer vite." },
          "next_node": "a2_over",
          "on_choose": { "flags_set": ["went_over_overpass"] }
        },
        {
          "label": { "en": "Go under. You can't afford another pulse in the open.", "fr": "Passe par-dessous. Tu peux pas te permettre une autre impulsion à découvert." },
          "next_node": "a2_under",
          "on_choose": { "flags_set": ["went_under_overpass"] }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_over": {
      "id": "a2_over",
      "act": 2,
      "title": "Over the overpass — finds records",
      "messages": [
        { "en": "Climbing. The structure is more solid than it looks — good steel under the rust.", "fr": "J'escalade. La structure est plus solide qu'elle en a l'air — de l'acier solide sous la rouille." },
        { "en": "The engineer in me is impressed. The survivor in me wishes there was a railing.", "fr": "L'ingénieure en moi est impressionnée. La survivante aurait aimé une rambarde." },
        { "en": "...", "fr": "..." },
        { "en": "I'm at the top.", "fr": "J'suis en haut." },
        { "en": "Oh.", "fr": "Oh." },
        { "en": "I can see everything. The desert, the facility, the whole broken world. It's... vast.", "fr": "Je vois tout. Le désert, l'installation, le monde entier brisé. C'est... vaste." },
        { "en": "There's another structure to the east. Smaller. Like a relay station. Might be useful to know about.", "fr": "Y'a une autre structure à l'est. Plus petite. Genre station relais. Ça pourrait être bon à savoir." },
        { "en": "And there's... someone up here. Was someone.", "fr": "Et y'a... quelqu'un ici. Y'avait quelqu'un." },
        { "en": "A body. Old. They climbed up and never came down.", "fr": "Un corps. Ancien. La personne est montée et jamais redescendue." },
        { "en": "They have a device. Some kind of data pad. Still has charge.", "fr": "Elle a un appareil. Une espèce de tablette de données. Encore chargée." },
        { "en": "I'm reading...", "fr": "Je lis..." },
        { "en": "\"Test 7 exceeded projected yield. Casualties within expected parameters.\"", "fr": "\"Test 7 a dépassé le rendement projeté. Pertes dans les paramètres attendus.\"" },
        { "en": "Expected parameters. That's what they called it.", "fr": "Paramètres attendus. C'est comme ça qu'ils appelaient ça." },
        { "en": "There's more on here. Facility access codes. Internal memos. I'm saving everything.", "fr": "Y'a plus de choses dessus. Des codes d'accès à l'installation. Des notes internes. Je sauvegarde tout." }
      ],
      "choices": null,
      "next_node": "a2_camp",
      "delay": { "seconds": 1800, "message": { "en": "Elara is climbing down and continuing the journey.", "fr": "Elara descend et continue le voyage." } },
      "on_enter": { "flags_set": ["has_facility_records"] }
    },

    "a2_under": {
      "id": "a2_under",
      "act": 2,
      "title": "Under the overpass — finds medical supplies",
      "messages": [
        { "en": "Going in. It's dark. My flashlight is mostly dead so I'm conserving it.", "fr": "J'entre. C'est sombre. Ma lampe est quasi morte alors je l'économise." },
        { "en": "The acoustics are definitely wrong. My footsteps echo twice. Three times. With a delay that doesn't make sense.", "fr": "L'acoustique est vraiment bizarre. Mes pas résonnent deux fois. Trois fois. Avec un délai qui a pas de sens." },
        { "en": "Trying not to think about what that means.", "fr": "J'essaie de pas penser à ce que ça veut dire." },
        { "en": "...", "fr": "..." },
        { "en": "Wait. There's a door. Sealed. Maintenance room?", "fr": "Attends. Y'a une porte. Scellée. Salle de maintenance ?" },
        { "en": "I can force this. The lock mechanism is mechanical — I just need to...", "fr": "Je peux forcer. Le mécanisme de verrou est mécanique — j'ai juste besoin de..." },
        { "en": "Got it.", "fr": "C'est ouvert." },
        { "en": "Oh. Oh this is good.", "fr": "Oh. Oh c'est bien ça." },
        { "en": "First aid kit — a real one, not scraps. Painkillers. Bandages. Some kind of salve in a labeled tube... anti-resonance compound? That's a thing?", "fr": "Une trousse de secours — une vraie, pas des bouts de rien. Des antidouleurs. Des bandages. Une espèce de pommade dans un tube étiqueté... composé anti-résonance ? C'est un truc ça ?" },
        { "en": "And there's shielding material here. Enough to wrap around the radio at least.", "fr": "Et y'a du matériau de blindage ici. Assez pour envelopper la radio au moins." },
        { "en": "I don't love being down here. But this was worth it.", "fr": "J'aime pas trop être là-dessous. Mais ça valait le coup." }
      ],
      "choices": null,
      "next_node": "a2_camp",
      "delay": { "seconds": 1800, "message": { "en": "Elara is moving through the tunnel.", "fr": "Elara avance dans le tunnel." } },
      "on_enter": { "health_change": 1, "flags_set": ["has_medicine", "has_shielding"] }
    },

    "a2_camp": {
      "id": "a2_camp",
      "act": 2,
      "title": "Making camp — dependency dynamic",
      "messages": [
        { "en": "I need to stop for the night. Finding a spot.", "fr": "Faut que je m'arrête pour la nuit. Je cherche un coin." },
        { "en": "...", "fr": "..." },
        { "en": "Okay. Sheltered. Not great, but it'll do.", "fr": "Ok. À l'abri. C'est pas le rêve, mais ça ira." },
        { "en": "Hey, quick question. Should I eat the rations tonight or save them? I have some canned stuff that's heavier to carry.", "fr": "Hé, question rapide. Je mange les rations ce soir ou je les garde ? J'ai des conserves qui sont plus lourdes à transporter." }
      ],
      "choices": [
        {
          "label": { "en": "Eat the canned food tonight — lighter pack tomorrow.", "fr": "Mange les conserves ce soir — sac plus léger demain." },
          "next_node": "a2_camp_2",
          "on_choose": {}
        },
        {
          "label": { "en": "Save the good stuff. You might need it later.", "fr": "Garde le bon. T'en auras peut-être besoin plus tard." },
          "next_node": "a2_camp_2",
          "on_choose": {}
        },
        {
          "label": { "en": "That's your call, Elara. You're the one there.", "fr": "C'est ton choix, Elara. C'est toi qui es sur place." },
          "next_node": "a2_camp_autonomy",
          "on_choose": { "trust_change": 1, "flags_set": ["pushed_autonomy"] }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_camp_autonomy": {
      "id": "a2_camp_autonomy",
      "act": 2,
      "title": "Player pushes autonomy",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Huh.", "fr": "Hm." },
        { "en": "You're right. That's... yeah. I keep asking you stuff I should just decide.", "fr": "T'as raison. C'est... ouais. J'arrête pas de te demander des trucs que je devrais juste décider." },
        { "en": "I'll eat the cans. They're heavy and I need the calories.", "fr": "Je mange les conserves. Elles sont lourdes et j'ai besoin des calories." },
        { "en": "See? I can make decisions. Groundbreaking.", "fr": "Tu vois ? J'suis capable de prendre des décisions. Révolutionnaire." }
      ],
      "choices": null,
      "next_node": "a2_dust_storm",
      "delay": null,
      "on_enter": null
    },

    "a2_camp_2": {
      "id": "a2_camp_2",
      "act": 2,
      "title": "Player made the food decision for her",
      "messages": [
        { "en": "Okay. Done.", "fr": "Ok. C'est fait." },
        { "en": "What about water? I have one full canteen and a half. Should I ration or drink normally?", "fr": "Et pour l'eau ? J'ai une gourde pleine et une à moitié. Je rationne ou je bois normalement ?" }
      ],
      "choices": [
        {
          "label": { "en": "Ration the water. You don't know when you'll find more.", "fr": "Rationne l'eau. Tu sais pas quand tu en trouveras." },
          "next_node": "a2_dust_storm",
          "on_choose": {}
        },
        {
          "label": { "en": "Drink what you need. Dehydration will slow you down.", "fr": "Bois ce qu'il te faut. La déshydratation va te ralentir." },
          "next_node": "a2_dust_storm",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_dust_storm": {
      "id": "a2_dust_storm",
      "act": 2,
      "title": "Dust storm hits",
      "messages": [
        { "en": "Oh no.", "fr": "Oh non." },
        { "en": "Dust storm. Big one. I can see it coming — wall of orange stretching across the horizon.", "fr": "Tempête de sable. Une grosse. Je la vois arriver — un mur orange qui s'étend sur tout l'horizon." },
        { "en": "I'm hunkering down. This shelter will have to do.", "fr": "Je me planque. Cet abri devra faire l'affaire." },
        { "en": "...", "fr": "..." },
        { "en": "Can't see five meters. The wind is screaming.", "fr": "On voit pas à cinq mètres. Le vent hurle." },
        { "en": "Well. I'm not going anywhere. Guess we talk.", "fr": "Bon. J'vais nulle part. On discute, j'imagine." }
      ],
      "choices": null,
      "next_node": "a2_storm_talking",
      "delay": null,
      "on_enter": null
    },

    "a2_storm_talking": {
      "id": "a2_storm_talking",
      "act": 2,
      "title": "Talking during the storm — relationship building",
      "messages": [
        { "en": "You know what I miss? Noise. Not the frequency kind. People noise.", "fr": "Tu sais ce qui me manque ? Le bruit. Pas le genre fréquence. Le bruit des gens." },
        { "en": "A cafeteria at lunch. Keyboards. Someone laughing too loud in the next room.", "fr": "Une cantine à midi. Des claviers. Quelqu'un qui rit trop fort dans la pièce d'à côté." },
        { "en": "I used to work with this team of eight. We maintained the pressure systems in a processing plant. Heavy, loud, dirty work.", "fr": "Je bossais avec une équipe de huit. On entretenait les systèmes de pression d'une usine de traitement. Du travail lourd, bruyant, sale." },
        { "en": "I loved it. Not the work. I mean, the work was fine. But the people.", "fr": "J'adorais ça. Pas le boulot. Enfin, le boulot ça allait. Mais les gens." },
        { "en": "Davi always had coffee for everyone. Ren sang while he worked, badly. Mikka argued with the machines like they could hear her.", "fr": "Davi avait toujours du café pour tout le monde. Ren chantait en travaillant, faux. Mikka engueulait les machines comme si elles pouvaient l'entendre." },
        { "en": "Now I argue with machines.", "fr": "Maintenant c'est moi qui engueule les machines." },
        { "en": "...", "fr": "..." },
        { "en": "Lina used to say I couldn't sit still for five minutes without fixing something.", "fr": "Lina disait que j'étais incapable de rester cinq minutes sans réparer un truc." },
        { "en": "She was...", "fr": "Elle était..." },
        { "en": "She was right about that.", "fr": "Elle avait raison." },
        { "en": "Anyway. Storm doesn't look like it's stopping anytime soon.", "fr": "Bref. La tempête a pas l'air de vouloir s'arrêter." }
      ],
      "choices": [
        {
          "label": { "en": "Who's Lina?", "fr": "C'est qui Lina ?" },
          "next_node": "a2_lina_asked",
          "on_choose": { "flags_set": ["lina_asked"] }
        },
        {
          "label": { "en": "Your team sounds great. Hang on to those memories.", "fr": "Ton équipe avait l'air super. Accroche-toi à ces souvenirs." },
          "next_node": "a2_storm_end",
          "on_choose": { "trust_change": 1 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_lina_asked": {
      "id": "a2_lina_asked",
      "act": 2,
      "title": "Player asks about Lina",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Someone. From before.", "fr": "Quelqu'un. D'avant." },
        { "en": "Can we talk about something else?", "fr": "On peut parler d'autre chose ?" },
        { "en": "Please.", "fr": "S'il te plaît." }
      ],
      "choices": null,
      "next_node": "a2_storm_end",
      "delay": null,
      "on_enter": { "trust_change": 0 }
    },

    "a2_storm_end": {
      "id": "a2_storm_end",
      "act": 2,
      "title": "Storm passes",
      "messages": [
        { "en": "Wind's dying down. I think it's passing.", "fr": "Le vent faiblit. Je crois que ça passe." },
        { "en": "Everything is coated in a new layer of dust. Including me.", "fr": "Tout est recouvert d'une nouvelle couche de poussière. Moi y compris." },
        { "en": "I look like a sandcastle someone gave up on.", "fr": "J'ai l'air d'un château de sable que quelqu'un a abandonné." },
        { "en": "Going to wait until it fully clears, then try to rest.", "fr": "Je vais attendre que ça se calme complètement, puis essayer de dormir." }
      ],
      "choices": null,
      "next_node": "a2_night_entity",
      "delay": { "seconds": 7200, "message": { "en": "Elara is waiting for the storm to clear and resting.", "fr": "Elara attend que la tempête passe et se repose." } },
      "on_enter": null
    },

    "a2_night_entity": {
      "id": "a2_night_entity",
      "act": 2,
      "title": "Night entity encounter",
      "messages": [
        { "en": "Hey. Hey, are you there?", "fr": "Hé. Hé, t'es là ?" },
        { "en": "I need to whisper.", "fr": "Faut que je chuchote." },
        { "en": "There's something outside.", "fr": "Y'a un truc dehors." },
        { "en": "Not a pulse. Something else. A shape.", "fr": "Pas une impulsion. Autre chose. Une forme." },
        { "en": "It's tall. Thin. Made of... static? Visual noise? I don't know how to describe it.", "fr": "C'est grand. Fin. Fait de... grésil ? De bruit visuel ? J'sais pas comment décrire." },
        { "en": "It's just standing there. About twenty meters away. Not moving.", "fr": "C'est juste là. À une vingtaine de mètres. Ça bouge pas." },
        { "en": "Like it's waiting.", "fr": "Comme si ça attendait." },
        { "en": "What do I do?", "fr": "Je fais quoi ?" }
      ],
      "choices": [
        {
          "label": { "en": "Stay hidden. Don't move. Don't make a sound. Wait for it to pass.", "fr": "Reste cachée. Bouge pas. Fais aucun bruit. Attends que ça passe." },
          "next_node": "a2_entity_hide",
          "on_choose": { "trust_change": 1 }
        },
        {
          "label": { "en": "Move now, quietly. Slip away while it's still. Don't wait for it to come closer.", "fr": "Bouge maintenant, doucement. Éclipse-toi pendant que c'est immobile. Attends pas que ça s'approche." },
          "next_node": "a2_entity_move_check",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a2_entity_hide": {
      "id": "a2_entity_hide",
      "act": 2,
      "title": "Hiding from entity",
      "messages": [
        { "en": "Okay. Not moving. Barely breathing.", "fr": "Ok. Je bouge pas. Je respire à peine." },
        { "en": "...", "fr": "..." },
        { "en": "Still there.", "fr": "Toujours là." },
        { "en": "...", "fr": "..." },
        { "en": "...still there.", "fr": "...toujours là." },
        { "en": "It turned. I think it turned.", "fr": "Ça a tourné. Je crois que ça a tourné." },
        { "en": "...", "fr": "..." },
        { "en": "It's fading. Like it's dissolving into the air.", "fr": "Ça s'estompe. Comme si ça se dissolvait dans l'air." },
        { "en": "...", "fr": "..." },
        { "en": "Gone.", "fr": "Parti." },
        { "en": "Okay. My heart is going to explode. But it's gone.", "fr": "Ok. Mon cœur va exploser. Mais c'est parti." },
        { "en": "I'm not sleeping tonight.", "fr": "J'dors pas cette nuit." }
      ],
      "choices": null,
      "next_node": "a3_travel_to_outpost",
      "delay": { "seconds": 1800, "message": { "en": "Elara is keeping watch through the night.", "fr": "Elara monte la garde toute la nuit." } },
      "on_enter": null
    },

    "a2_entity_move_check": {
      "id": "a2_entity_move_check",
      "act": 2,
      "title": "Entity movement — conditional branch",
      "messages": [
        { "en": "Okay. Moving. Slow.", "fr": "Ok. Je bouge. Doucement." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "on_enter": null,
      "branch": [
        { "condition": { "flags_required": ["has_shielding"] }, "next_node": "a2_entity_move_success" },
        { "condition": { "default": true }, "next_node": "a2_entity_move_fail" }
      ]
    },

    "a2_entity_move_success": {
      "id": "a2_entity_move_success",
      "act": 2,
      "title": "Successfully slipped past entity",
      "messages": [
        { "en": "The shielding mesh. I wrapped it around my shoulders and the radio. It's dampening something — the entity isn't reacting.", "fr": "La maille de blindage. Je l'ai enroulée autour de mes épaules et de la radio. Ça atténue quelque chose — l'entité réagit pas." },
        { "en": "Walking. Not looking back.", "fr": "Je marche. Je regarde pas derrière." },
        { "en": "...", "fr": "..." },
        { "en": "I'm clear. I think I'm clear.", "fr": "Je suis sortie. Je crois que je suis sortie." },
        { "en": "Okay. That was smooth. Thank the shielding.", "fr": "Ok. C'était propre. Merci le blindage." }
      ],
      "choices": null,
      "next_node": "a3_travel_to_outpost",
      "delay": { "seconds": 900, "message": { "en": "Elara is putting distance between herself and the entity.", "fr": "Elara met de la distance entre elle et l'entité." } },
      "on_enter": null
    },

    "a2_entity_move_fail": {
      "id": "a2_entity_move_fail",
      "act": 2,
      "title": "Entity detected her",
      "messages": [
        { "en": "It moved. The second I stepped out, it MOVED.", "fr": "Ça a bougé. À la seconde où j'ai bougé, ça a BOUGÉ." },
        { "en": "Running.", "fr": "Je cours." },
        { "en": "There's a sound — not sound — pressure — localized — it's like a pulse but TARGETED —", "fr": "Y'a un son — pas un son — de la pression — localisée — c'est comme une impulsion mais CIBLÉE —" },
        { "en": "MY EARS", "fr": "MES OREILLES" },
        { "en": "...", "fr": "..." },
        { "en": "I'm... I'm behind something. A wall. It didn't follow.", "fr": "J'suis... j'suis derrière un truc. Un mur. Ça a pas suivi." },
        { "en": "I can't hear properly. Everything's ringing. There's blood coming from my left ear.", "fr": "J'entends plus bien. Tout sonne. Y'a du sang qui coule de mon oreille gauche." },
        { "en": "That was a mistake. That was a bad call.", "fr": "C'était une erreur. C'était un mauvais choix." }
      ],
      "choices": null,
      "next_node": "a3_travel_to_outpost",
      "delay": { "seconds": 1800, "message": { "en": "Elara is recovering from the entity encounter.", "fr": "Elara récupère de la rencontre avec l'entité." } },
      "on_enter": { "health_change": -2, "flags_set": ["entity_move_failed"] }
    },

    "a3_travel_to_outpost": {
      "id": "a3_travel_to_outpost",
      "act": 3,
      "title": "Traveling toward outpost",
      "messages": [
        { "en": "Day... what day is it? I've lost count.", "fr": "Jour... quel jour on est ? J'ai perdu le compte." },
        { "en": "My feet hurt. Everything hurts, actually. But mostly my feet.", "fr": "J'ai mal aux pieds. J'ai mal partout en fait. Mais surtout aux pieds." },
        { "en": "The facility is definitely closer. I can make out details now. Towers, ventilation stacks, a perimeter wall.", "fr": "L'installation est clairement plus proche. Je distingue des détails maintenant. Des tours, des cheminées de ventilation, un mur d'enceinte." },
        { "en": "But there's something else first. A smaller building ahead. Some kind of relay station?", "fr": "Mais y'a autre chose avant. Un bâtiment plus petit devant. Une espèce de station relais ?" },
        { "en": "I'm going to check it out. Might find supplies. Or info.", "fr": "Je vais aller voir. Peut-être des provisions. Ou des infos." },
        { "en": "I'll be in touch once I'm in", "fr": "Je te recontacte une fois que j'suis à l'intéri" }
      ],
      "choices": null,
      "next_node": "a3_radio_silence",
      "delay": null,
      "on_enter": null
    },

    "a3_radio_silence": {
      "id": "a3_radio_silence",
      "act": 3,
      "title": "Radio cuts out — pulse damage",
      "messages": [],
      "choices": null,
      "next_node": "a3_radio_repair",
      "delay": { "seconds": 7200, "message": { "en": "Elara is not available. The signal was lost during a frequency pulse.", "fr": "Elara n'est pas disponible. Le signal a été perdu pendant une impulsion de fréquence." } },
      "on_enter": { "health_change": -1 }
    },

    "a3_radio_repair": {
      "id": "a3_radio_repair",
      "act": 3,
      "title": "Radio repaired — she's back",
      "messages": [
        { "en": "...hey.", "fr": "...salut." },
        { "en": "Sorry about that.", "fr": "Désolée pour ça." },
        { "en": "A pulse hit while I was approaching the relay station. Caught me in the open.", "fr": "Une impulsion a frappé pendant que j'approchais de la station relais. En plein découvert." },
        { "en": "The oscillator blew. Had to rebuild it from scratch with half the parts I used last time.", "fr": "L'oscillateur a grillé. J'ai dû le reconstruire à partir de rien avec la moitié des pièces d'avant." },
        { "en": "My hands wouldn't stop shaking. Not from the cold.", "fr": "Mes mains arrêtaient pas de trembler. Pas à cause du froid." },
        { "en": "For about an hour I thought... I thought it was done. That I'd lost you.", "fr": "Pendant environ une heure j'ai cru... j'ai cru que c'était fini. Que je t'avais perdu." },
        { "en": "That hour was worse than the whole three months.", "fr": "Cette heure a été pire que les trois mois entiers." },
        { "en": "...", "fr": "..." },
        { "en": "But it works. I'm here. We're here.", "fr": "Mais ça marche. J'suis là. On est là." }
      ],
      "choices": null,
      "next_node": "a3_doubt",
      "delay": null,
      "on_enter": null
    },

    "a3_doubt": {
      "id": "a3_doubt",
      "act": 3,
      "title": "The doubt — critical scene",
      "messages": [
        { "en": "Can I ask you something weird?", "fr": "Je peux te poser une question bizarre ?" },
        { "en": "Who are you?", "fr": "T'es qui ?" },
        { "en": "No, I mean — who are you actually. Where are you. How are you hearing me.", "fr": "Non, je veux dire — t'es qui vraiment. T'es où. Comment tu m'entends." },
        { "en": "I built this radio from a dead tablet and some wire. It shouldn't reach anyone. The range should be maybe a kilometer.", "fr": "J'ai construit cette radio avec une tablette morte et du fil. Ça devrait capter personne. La portée devrait être d'un kilomètre max." },
        { "en": "So either I got impossibly, absurdly lucky...", "fr": "Soit j'ai eu une chance impossible, absurde..." },
        { "en": "...or I've been talking to myself for days and I'm too far gone to notice.", "fr": "...soit je me parle à moi-même depuis des jours et j'suis trop partie pour m'en rendre compte." }
      ],
      "choices": [
        {
          "label": { "en": "I don't know how this works either. But I hear you, and I'm here.", "fr": "Je sais pas non plus comment ça marche. Mais je t'entends, et j'suis là." },
          "next_node": "a3_doubt_honest",
          "on_choose": { "trust_change": 2, "flags_set": ["doubt_honest"] }
        },
        {
          "label": { "en": "I'm real. That's what matters. Don't spiral on this.", "fr": "J'suis réel. C'est tout ce qui compte. Te laisse pas entraîner là-dedans." },
          "next_node": "a3_doubt_reassure",
          "on_choose": { "trust_change": 1, "flags_set": ["doubt_reassure"] }
        },
        {
          "label": { "en": "Come on, don't think about that. Focus on the mission.", "fr": "Allez, pense pas à ça. Concentre-toi sur la mission." },
          "next_node": "a3_doubt_deflect",
          "on_choose": { "trust_change": -2, "flags_set": ["doubt_deflect"] }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a3_doubt_honest": {
      "id": "a3_doubt_honest",
      "act": 3,
      "title": "Honest response to doubt",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Okay.", "fr": "Ok." },
        { "en": "Okay, that's actually... weirdly reassuring. At least we're both confused.", "fr": "Ok, c'est en fait... bizarrement rassurant. Au moins on est paumés tous les deux." },
        { "en": "I don't need you to explain it. I just needed you to not pretend it makes sense.", "fr": "J'ai pas besoin que tu m'expliques. J'avais juste besoin que tu fasses pas semblant que ça a du sens." },
        { "en": "Thank you for that.", "fr": "Merci pour ça." }
      ],
      "choices": null,
      "next_node": "a3_outpost",
      "delay": null,
      "on_enter": null
    },

    "a3_doubt_reassure": {
      "id": "a3_doubt_reassure",
      "act": 3,
      "title": "Reassurance response to doubt",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Yeah. Yeah, you're right.", "fr": "Ouais. Ouais, t'as raison." },
        { "en": "Sorry. The silence after the radio broke got to me.", "fr": "Pardon. Le silence après la panne de radio m'a atteinte." },
        { "en": "Forget I said anything.", "fr": "Oublie ce que j'ai dit." }
      ],
      "choices": null,
      "next_node": "a3_outpost",
      "delay": null,
      "on_enter": null
    },

    "a3_doubt_deflect": {
      "id": "a3_doubt_deflect",
      "act": 3,
      "title": "Deflection response to doubt",
      "messages": [
        { "en": "Right.", "fr": "D'accord." },
        { "en": "Sure. The mission.", "fr": "Ouais. La mission." },
        { "en": "Forget it.", "fr": "Laisse tomber." }
      ],
      "choices": null,
      "next_node": "a3_outpost",
      "delay": null,
      "on_enter": null
    },

    "a3_outpost": {
      "id": "a3_outpost",
      "act": 3,
      "title": "Arriving at the outpost",
      "messages": [
        { "en": "I'm inside the relay station. Better shape than I expected.", "fr": "J'suis dans la station relais. En meilleur état que prévu." },
        { "en": "Reinforced walls. Some power still running — emergency circuits maybe.", "fr": "Murs renforcés. Du courant encore — des circuits de secours peut-être." },
        { "en": "And there are working terminals.", "fr": "Et y'a des terminaux fonctionnels." },
        { "en": "I'm reading. Give me a minute.", "fr": "Je lis. Donne-moi une minute." }
      ],
      "choices": null,
      "next_node": "a3_logs_technical",
      "delay": { "seconds": 600, "message": { "en": "Elara is reading facility records.", "fr": "Elara lit les dossiers de l'installation." } },
      "on_enter": null
    },

    "a3_logs_technical": {
      "id": "a3_logs_technical",
      "act": 3,
      "title": "Reading technical logs",
      "messages": [
        { "en": "Okay. I've been reading.", "fr": "Bon. J'ai lu." },
        { "en": "Resonance frequency maps. Propagation models. Technical stuff I mostly understand.", "fr": "Des cartes de fréquence de résonance. Des modèles de propagation. Des trucs techniques que je comprends en grande partie." },
        { "en": "And casualty projections.", "fr": "Et des projections de pertes." },
        { "en": "\"Projected surface impact: 94-97% lethality at full propagation.\"", "fr": "\"Impact de surface projeté : 94-97% de létalité en propagation totale.\"" },
        { "en": "94 to 97 percent.", "fr": "94 à 97 pour cent." },
        { "en": "They had the numbers. Before they turned it on. They had the numbers.", "fr": "Ils avaient les chiffres. Avant de l'allumer. Ils avaient les chiffres." },
        { "en": "Wait. There's something else here. Not a terminal file. A physical journal. Under the desk.", "fr": "Attends. Y'a autre chose ici. Pas un fichier terminal. Un journal physique. Sous le bureau." }
      ],
      "choices": null,
      "next_node": "a3_vasik_journal",
      "delay": null,
      "on_enter": null
    },

    "a3_vasik_journal": {
      "id": "a3_vasik_journal",
      "act": 3,
      "title": "Dr. Vasik's journal — the truth",
      "messages": [
        { "en": "It's a journal. Handwritten. The name on the cover says Dr. Aren Vasik. Lead Resonance Physicist.", "fr": "C'est un journal. Manuscrit. Le nom sur la couverture dit Dr. Aren Vasik. Physicien Résonance en chef." },
        { "en": "The handwriting gets worse as the entries go on.", "fr": "L'écriture se dégrade au fil des entrées." },
        { "en": "Early ones are clean. Optimistic. \"Frequency coupling confirmed. Applications beyond projections.\"", "fr": "Les premières sont propres. Optimistes. \"Couplage de fréquence confirmé. Applications au-delà des projections.\"" },
        { "en": "Middle entries. Doubt. \"Models show cascading bio-neural interference at scale. Flagged to oversight. Response: 'Adjust parameters and proceed.'\"", "fr": "Entrées du milieu. Du doute. \"Les modèles montrent des interférences bio-neurales en cascade à grande échelle. Signalé au comité. Réponse : 'Ajustez les paramètres et continuez.'\"" },
        { "en": "Then the last one.", "fr": "Puis la dernière." },
        { "en": "...", "fr": "..." },
        { "en": "\"They didn't adjust anything. I ran the numbers myself. They already had the real projections. They knew what full propagation would do. They called it acceptable.\"", "fr": "\"Ils ont rien ajusté. J'ai refait les calculs moi-même. Ils avaient déjà les vraies projections. Ils savaient ce que la propagation totale ferait. Ils ont appelé ça acceptable.\"" },
        { "en": "\"I'm the one who designed the emitter. These are my blueprints. I built the machine that ended the world and I didn't even know it until it was too late.\"", "fr": "\"C'est moi qui ai conçu l'émetteur. Ce sont mes plans. J'ai construit la machine qui a mis fin au monde et je le savais même pas avant qu'il soit trop tard.\"" },
        { "en": "\"God forgive us all.\"", "fr": "\"Que Dieu nous pardonne à tous.\"" }
      ],
      "choices": null,
      "next_node": "a3_truth_reaction",
      "delay": null,
      "on_enter": null
    },

    "a3_truth_reaction": {
      "id": "a3_truth_reaction",
      "act": 3,
      "title": "Elara's reaction to the truth",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "He was an engineer. Like me.", "fr": "C'était un ingénieur. Comme moi." },
        { "en": "He built something and it worked exactly the way it was supposed to.", "fr": "Il a construit un truc et ça a marché exactement comme prévu." },
        { "en": "And it killed everyone.", "fr": "Et ça a tué tout le monde." },
        { "en": "...", "fr": "..." },
        { "en": "Lina included.", "fr": "Lina y compris." },
        { "en": "...", "fr": "..." },
        { "en": "The schematics on these terminals show two shutdown options.", "fr": "Les schémas sur ces terminaux montrent deux options d'arrêt." }
      ],
      "choices": null,
      "next_node": "a3_fork",
      "delay": null,
      "on_enter": null
    },

    "a3_fork": {
      "id": "a3_fork",
      "act": 3,
      "title": "The fork — direct vs failsafe",
      "messages": [
        { "en": "Option one. I go straight to the facility. Maybe three days from here. Enter the core and shut down the emitter manually. I understand the engineering. But the core is ground zero. The frequency exposure in there would be..." , "fr": "Option un. J'y vais direct. Peut-être trois jours d'ici. J'entre dans le cœur et j'éteins l'émetteur manuellement. Je comprends l'ingénierie. Mais le cœur c'est le point zéro. L'exposition à la fréquence là-dedans serait..." },
        { "en": "Bad. Really bad.", "fr": "Grave. Vraiment grave." },
        { "en": "Option two. There's a remote failsafe terminal at a secondary relay site. About three days in the other direction. I could try a remote shutdown from there. Less exposure. But the system might not have power. It might not work. And if it doesn't, I have to backtrack. Days lost.", "fr": "Option deux. Y'a un terminal de sécurité à distance dans un site relais secondaire. Environ trois jours dans l'autre direction. Je pourrais tenter un arrêt à distance depuis là-bas. Moins d'exposition. Mais le système a peut-être plus de courant. Ça marchera peut-être pas. Et si ça marche pas, faut que je revienne. Des jours perdus." },
        { "en": "Both options are terrible.", "fr": "Les deux options sont nulles." },
        { "en": "What do you think?", "fr": "T'en penses quoi ?" }
      ],
      "choices": [
        {
          "label": { "en": "Go direct. You know the engineering. Don't risk the detour on a maybe.", "fr": "Vas-y direct. Tu connais l'ingénierie. Risque pas le détour pour un peut-être." },
          "next_node": "a4d_closing_in",
          "on_choose": { "flags_set": ["chose_direct_path"] }
        },
        {
          "label": { "en": "Try the failsafe. If there's a way to do this without destroying your body, take it.", "fr": "Tente la sécurité. S'il y a un moyen de faire ça sans te détruire, prends-le." },
          "next_node": "a4f_detour_start",
          "on_choose": { "flags_set": ["chose_failsafe"] }
        }
      ],
      "next_node": null,
      "delay": { "seconds": 28800, "message": { "en": "Elara is resting at the outpost. First safe sleep in days.", "fr": "Elara se repose à la station. Premier sommeil tranquille depuis des jours." } },
      "on_enter": { "health_change": 1 }
    },

    "a4d_closing_in": {
      "id": "a4d_closing_in",
      "act": 4,
      "title": "Direct path — approaching facility",
      "messages": [
        { "en": "Straight to the heart of it then.", "fr": "Droit au cœur alors." },
        { "en": "The landscape is changing. Ground is warmer underfoot. The air tastes metallic.", "fr": "Le paysage change. Le sol est plus chaud sous les pieds. L'air a un goût métallique." },
        { "en": "And the hum. I could always hear it faintly but now it's... present. In my ribs. In my teeth.", "fr": "Et le bourdonnement. Je l'entendais toujours faiblement mais maintenant c'est... présent. Dans mes côtes. Dans mes dents." },
        { "en": "The entities are more visible here. Not just flickers. Sustained shapes that track my movement.", "fr": "Les entités sont plus visibles ici. Plus juste des scintillements. Des formes soutenues qui suivent mes mouvements." },
        { "en": "I can see the facility clearly now. It's massive. Like a dead city.", "fr": "Je vois l'installation clairement maintenant. C'est massif. Comme une ville morte." },
        { "en": "My headache won't stop. My hands are trembling. Coughed this morning. Pink.", "fr": "Mon mal de tête s'arrête pas. Mes mains tremblent. J'ai toussé ce matin. Rose." },
        { "en": "That's probably fine.", "fr": "C'est sûrement rien." }
      ],
      "choices": [
        {
          "label": { "en": "Push the pace. The sooner you get there, the sooner it's over.", "fr": "Force l'allure. Plus vite t'y es, plus vite c'est fini." },
          "next_node": "a4d_push_fast",
          "on_choose": {}
        },
        {
          "label": { "en": "Go slow. Shelter during every pulse. Your body needs to last until you reach the core.", "fr": "Vas-y doucement. Abrite-toi à chaque impulsion. Ton corps doit tenir jusqu'au cœur." },
          "next_node": "a4d_go_slow",
          "on_choose": { "trust_change": 1 }
        }
      ],
      "next_node": null,
      "delay": { "seconds": 1800, "message": { "en": "Elara is traveling toward the facility.", "fr": "Elara se dirige vers l'installation." } },
      "on_enter": null
    },

    "a4d_push_fast": {
      "id": "a4d_push_fast",
      "act": 4,
      "title": "Pushing pace — more damage",
      "messages": [
        { "en": "Fast it is. No more stops.", "fr": "En vitesse alors. Plus d'arrêts." },
        { "en": "...", "fr": "..." },
        { "en": "Two pulses in the last few hours. Didn't shelter. Kept walking.", "fr": "Deux impulsions dans les dernières heures. J'me suis pas abritée. J'ai continué à marcher." },
        { "en": "The nosebleeds are constant now. I've stopped wiping.", "fr": "Les saignements de nez sont constants maintenant. J'ai arrêté d'essuyer." },
        { "en": "But I'm close. I can see the perimeter wall.", "fr": "Mais j'suis proche. Je vois le mur d'enceinte." }
      ],
      "choices": null,
      "next_node": "a4d_breaking_point",
      "delay": { "seconds": 1200, "message": { "en": "Elara is pushing toward the facility.", "fr": "Elara force la marche vers l'installation." } },
      "on_enter": { "health_change": -3 }
    },

    "a4d_go_slow": {
      "id": "a4d_go_slow",
      "act": 4,
      "title": "Going slow — sheltering",
      "messages": [
        { "en": "Slow. Okay. Smart.", "fr": "Doucement. Ok. Malin." },
        { "en": "Every time the pressure builds, I stop. Find cover. Wait.", "fr": "À chaque fois que la pression monte, je m'arrête. Je trouve un abri. J'attends." },
        { "en": "It's frustrating. The facility is right there. I can see it.", "fr": "C'est frustrant. L'installation est juste là. Je la vois." },
        { "en": "But I'm still standing. So. Good call.", "fr": "Mais j'suis encore debout. Donc. Bon choix." }
      ],
      "choices": null,
      "next_node": "a4d_breaking_point",
      "delay": { "seconds": 3600, "message": { "en": "Elara is sheltering between pulses and advancing slowly.", "fr": "Elara s'abrite entre les impulsions et avance lentement." } },
      "on_enter": { "health_change": -1 }
    },

    "a4d_breaking_point": {
      "id": "a4d_breaking_point",
      "act": 4,
      "title": "Breaking point — branches by trust",
      "messages": [
        { "en": "I need to stop. Just for a minute.", "fr": "Faut que j'm'arrête. Juste une minute." },
        { "en": "...", "fr": "..." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "on_enter": null,
      "branch": [
        { "condition": { "min_trust": 7 }, "next_node": "a4d_bp_high_trust" },
        { "condition": { "min_trust": 4 }, "next_node": "a4d_bp_mid_trust" },
        { "condition": { "default": true }, "next_node": "a4d_bp_low_trust" }
      ]
    },

    "a4d_bp_high_trust": {
      "id": "a4d_bp_high_trust",
      "act": 4,
      "title": "Breaking point — high trust",
      "messages": [
        { "en": "I need to say something.", "fr": "Faut que je dise un truc." },
        { "en": "I've been leaning on you. A lot. And I think that's been keeping me together.", "fr": "Je me suis appuyée sur toi. Beaucoup. Et je crois que c'est ça qui m'a tenue." },
        { "en": "But I need to know I can do this even if the radio dies. Even if you go quiet.", "fr": "Mais j'ai besoin de savoir que je peux le faire même si la radio lâche. Même si tu te tais." },
        { "en": "I need to know there's still someone in here.", "fr": "J'ai besoin de savoir qu'il y a encore quelqu'un là-dedans." },
        { "en": "So I'm going to make the calls from here. But I want your input. I always want your input.", "fr": "Alors c'est moi qui vais décider à partir d'ici. Mais je veux ton avis. Je veux toujours ton avis." },
        { "en": "Okay?", "fr": "Ok ?" }
      ],
      "choices": [
        {
          "label": { "en": "I'm proud of you. Let's finish this.", "fr": "J'suis fier de toi. On finit ça." },
          "next_node": "a4d_gates",
          "on_choose": { "trust_change": 1 }
        },
        {
          "label": { "en": "Okay. I'm not going anywhere.", "fr": "Ok. J'irai nulle part." },
          "next_node": "a4d_gates",
          "on_choose": { "trust_change": 1 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a4d_bp_mid_trust": {
      "id": "a4d_bp_mid_trust",
      "act": 4,
      "title": "Breaking point — medium trust",
      "messages": [
        { "en": "I don't know if I'm doing this for the right reasons anymore.", "fr": "J'sais plus si je fais ça pour les bonnes raisons." },
        { "en": "Am I going to that facility because it matters? Or because I don't know what else to do with myself?", "fr": "J'y vais parce que c'est important ? Ou parce que j'sais pas quoi faire d'autre ?" },
        { "en": "If I stop walking I have to sit with... everything. And I can't. I can't do that yet.", "fr": "Si j'm'arrête de marcher faut que je reste avec... tout. Et je peux pas. Pas encore." }
      ],
      "choices": [
        {
          "label": { "en": "It matters. Even if no one's left to see it, shutting this down means something.", "fr": "C'est important. Même s'il reste personne pour le voir, arrêter ça veut dire quelque chose." },
          "next_node": "a4d_gates",
          "on_choose": { "trust_change": 1 }
        },
        {
          "label": { "en": "Maybe both. And that's okay. You don't need a pure reason to keep going.", "fr": "Peut-être les deux. Et c'est pas grave. T'as pas besoin d'une raison pure pour continuer." },
          "next_node": "a4d_gates",
          "on_choose": { "trust_change": 2 }
        },
        {
          "label": { "en": "You need to figure that out for yourself.", "fr": "C'est à toi de trouver la réponse." },
          "next_node": "a4d_gates",
          "on_choose": { "trust_change": -1 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a4d_bp_low_trust": {
      "id": "a4d_bp_low_trust",
      "act": 4,
      "title": "Breaking point — low trust",
      "messages": [
        { "en": "Why am I even doing this?", "fr": "Pourquoi je fais ça au juste ?" },
        { "en": "For who? Everyone's dead.", "fr": "Pour qui ? Tout le monde est mort." },
        { "en": "You're a voice in a box. I don't even know if you care. Maybe you're just watching to see what happens.", "fr": "T'es une voix dans une boîte. J'sais même pas si ça t'intéresse. Tu regardes peut-être juste pour voir ce qui se passe." },
        { "en": "Tell me. Why should I keep walking.", "fr": "Dis-moi. Pourquoi je devrais continuer à marcher." }
      ],
      "choices": [
        {
          "label": { "en": "I care. I've been here this whole time because I care.", "fr": "Ça m'intéresse. J'suis là depuis le début parce que ça m'intéresse." },
          "next_node": "a4d_gates_low",
          "on_choose": { "trust_change": 1 }
        },
        {
          "label": { "en": "You're right to be angry. But you've come too far to stop now.", "fr": "T'as le droit d'être en colère. Mais t'as fait trop de chemin pour t'arrêter maintenant." },
          "next_node": "a4d_gates_low",
          "on_choose": { "trust_change": 0 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a4d_gates": {
      "id": "a4d_gates",
      "act": 4,
      "title": "Facility gates — high/mid trust",
      "messages": [
        { "en": "I'm here.", "fr": "J'y suis." },
        { "en": "The facility perimeter. It's massive up close. Concrete and steel, still humming.", "fr": "Le périmètre de l'installation. C'est massif de près. Béton et acier, ça vibre encore." },
        { "en": "There are bodies near the entrance. Lab coats, work gear. They died at their posts.", "fr": "Y'a des corps près de l'entrée. Blouses de labo, tenues de travail. Ils sont morts à leur poste." },
        { "en": "Found an ID badge. Dr. Aren Vasik.", "fr": "J'ai trouvé un badge. Dr. Aren Vasik." },
        { "en": "I'm keeping it. Don't know why.", "fr": "Je le garde. J'sais pas pourquoi." },
        { "en": "Two ways in.", "fr": "Deux entrées." },
        { "en": "Main entrance. I can see inside — open, lit by emergency lights. Direct to the core. But exposed.", "fr": "Entrée principale. Je vois l'intérieur — ouvert, éclairé par les lumières de secours. Direct vers le cœur. Mais exposé." },
        { "en": "Or the service tunnel. Underground. Sheltered, but closer to the frequency source. The exposure will be worse down there.", "fr": "Ou le tunnel de service. Souterrain. Abrité, mais plus proche de la source de fréquence. L'exposition sera pire en bas." }
      ],
      "choices": [
        {
          "label": { "en": "Main entrance. You need to see what's coming.", "fr": "Entrée principale. Tu dois voir ce qui arrive." },
          "next_node": "a5_enter_facility",
          "on_choose": { "flags_set": ["entered_main", "vasik_badge"] }
        },
        {
          "label": { "en": "Service tunnel. The shelter is worth it — you can't take another open pulse.", "fr": "Tunnel de service. L'abri en vaut la peine — tu peux pas encaisser une autre impulsion à découvert." },
          "next_node": "a5_enter_facility",
          "on_choose": { "health_change": -1, "flags_set": ["entered_tunnel", "vasik_badge"] }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a4d_gates_low": {
      "id": "a4d_gates_low",
      "act": 4,
      "title": "Facility gates — low trust",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Fine. I'm here anyway.", "fr": "Bon. J'y suis de toute façon." },
        { "en": "The facility. It's right in front of me.", "fr": "L'installation. Elle est juste devant moi." },
        { "en": "I'm going in through the main entrance. I don't care about the exposure anymore.", "fr": "J'entre par l'entrée principale. J'en ai rien à faire de l'exposition maintenant." }
      ],
      "choices": null,
      "next_node": "a5_enter_facility",
      "delay": null,
      "on_enter": { "flags_set": ["entered_main", "vasik_badge"] }
    },

    "a4f_detour_start": {
      "id": "a4f_detour_start",
      "act": 4,
      "title": "Failsafe path — departing toward relay",
      "messages": [
        { "en": "The failsafe. Okay. That means walking away from the facility.", "fr": "La sécurité. Ok. Ça veut dire m'éloigner de l'installation." },
        { "en": "Every step feels backwards. But if this works, I don't have to walk into that thing.", "fr": "Chaque pas a l'air d'aller en arrière. Mais si ça marche, j'ai pas à entrer dans ce truc." },
        { "en": "Three days. Maybe less if I push.", "fr": "Trois jours. Peut-être moins si je force." }
      ],
      "choices": null,
      "next_node": "a4f_desolate_walk",
      "delay": { "seconds": 3600, "message": { "en": "Elara is traveling toward the failsafe relay site.", "fr": "Elara se dirige vers le site relais de sécurité." } },
      "on_enter": null
    },

    "a4f_desolate_walk": {
      "id": "a4f_desolate_walk",
      "act": 4,
      "title": "Walking through ruins",
      "messages": [
        { "en": "The landscape is different this direction. Less industrial. More... human.", "fr": "Le paysage est différent par ici. Moins industriel. Plus... humain." },
        { "en": "Settlement ruins. Not scrap camps. Actual homes.", "fr": "Des ruines de colonies. Pas des camps de ferraille. De vraies maisons." },
        { "en": "Laundry on a line. Still there. Three months of wind and sun and it's still hanging.", "fr": "Du linge sur un fil. Encore là. Trois mois de vent et de soleil et il est toujours accroché." },
        { "en": "Shoes by a door. A bicycle on its side.", "fr": "Des chaussures devant une porte. Un vélo sur le côté." },
        { "en": "It's like everyone just stepped out for a minute and forgot to come back.", "fr": "C'est comme si tout le monde était sorti une minute et avait oublié de revenir." }
      ],
      "choices": null,
      "next_node": "a4f_settlement",
      "delay": { "seconds": 1800, "message": { "en": "Elara is moving through the abandoned settlement.", "fr": "Elara traverse la colonie abandonnée." } },
      "on_enter": null
    },

    "a4f_settlement": {
      "id": "a4f_settlement",
      "act": 4,
      "title": "The larger settlement",
      "messages": [
        { "en": "Found a larger settlement. More intact than anything I've seen. Almost untouched.", "fr": "J'ai trouvé une colonie plus grande. Plus intacte que tout ce que j'ai vu. Presque pas touchée." },
        { "en": "Except for the people.", "fr": "Sauf les gens." },
        { "en": "I'm going to look around. Might find supplies or directions to the relay site.", "fr": "Je vais faire le tour. Peut-être des provisions ou des indications vers le site relais." }
      ],
      "choices": null,
      "next_node": "a4f_child_room",
      "delay": { "seconds": 900, "message": { "en": "Elara is searching the settlement.", "fr": "Elara fouille la colonie." } },
      "on_enter": { "supplies_change": 1, "has_medicine_conditional": true }
    },

    "a4f_child_room": {
      "id": "a4f_child_room",
      "act": 4,
      "title": "The child's room",
      "messages": [
        { "en": "I went into one of the houses. Looking for a map or anything useful.", "fr": "J'suis entrée dans une des maisons. Je cherchais une carte ou quoi que ce soit d'utile." },
        { "en": "Found a kid's room instead.", "fr": "J'ai trouvé une chambre d'enfant à la place." },
        { "en": "Small bed. Toys on the floor. Drawings on the wall. Bright colors. A family, a dog, a sun with a smiley face.", "fr": "Petit lit. Des jouets par terre. Des dessins au mur. Des couleurs vives. Une famille, un chien, un soleil avec un sourire." },
        { "en": "...", "fr": "..." },
        { "en": "Lina drew on the walls when she was small. Mom was furious. Dad thought it was hilarious.", "fr": "Lina dessinait sur les murs quand elle était petite. Maman était furieuse. Papa trouvait ça hilarant." },
        { "en": "I haven't thought about that in months.", "fr": "J'ai pas pensé à ça depuis des mois." },
        { "en": "...", "fr": "..." }
      ],
      "choices": [
        {
          "label": { "en": "Tell me about Lina.", "fr": "Parle-moi de Lina." },
          "next_node": "a4f_lina_deep",
          "on_choose": { "trust_change": 1 }
        },
        {
          "label": { "en": "Take your time. I'm here.", "fr": "Prends ton temps. J'suis là." },
          "next_node": "a4f_lina_deep",
          "on_choose": { "trust_change": 2 }
        },
        {
          "label": { "en": "We should keep moving. The relay site isn't far.", "fr": "On devrait continuer. Le site relais est pas loin." },
          "next_node": "a4f_relay_site",
          "on_choose": { "trust_change": -1 }
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a4f_lina_deep": {
      "id": "a4f_lina_deep",
      "act": 4,
      "title": "Deep Lina moment",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "Lina was my sister.", "fr": "Lina était ma sœur." },
        { "en": "Two years younger. But she was the smart one. The brave one. The one who actually said what she felt instead of deflecting with jokes.", "fr": "Deux ans de moins. Mais c'était elle la maligne. La courageuse. Celle qui disait vraiment ce qu'elle ressentait au lieu de détourner avec des blagues." },
        { "en": "She was a graphic designer. She could look at something ugly and broken and see what it could be.", "fr": "Elle était graphiste. Elle pouvait regarder un truc moche et cassé et voir ce que ça pourrait devenir." },
        { "en": "She was 25.", "fr": "Elle avait 25 ans." },
        { "en": "...", "fr": "..." },
        { "en": "She hummed when she was concentrating. This melody. She didn't know she did it.", "fr": "Elle fredonnait quand elle se concentrait. Cette mélodie. Elle savait même pas qu'elle le faisait." },
        { "en": "I catch myself doing it now. Humming her song. And every time I stop because it's not mine. It was hers.", "fr": "Je me surprends à le faire maintenant. Fredonner sa chanson. Et à chaque fois je m'arrête parce que c'est pas la mienne. C'était la sienne." },
        { "en": "I don't know why I'm telling you this.", "fr": "J'sais pas pourquoi je te raconte ça." },
        { "en": "Actually, no. I know exactly why. Because there's no one else to tell.", "fr": "En fait, non. Je sais exactement pourquoi. Parce qu'il y a personne d'autre à qui le dire." },
        { "en": "...", "fr": "..." },
        { "en": "Okay. I'm closing this door now. The room. Not the conversation.", "fr": "Bon. Je ferme cette porte. La chambre. Pas la conversation." },
        { "en": "Let's find that relay site.", "fr": "Allons trouver ce site relais." }
      ],
      "choices": null,
      "next_node": "a4f_relay_site",
      "delay": null,
      "on_enter": { "flags_set": ["lina_opened_up"] }
    },

    "a4f_relay_site": {
      "id": "a4f_relay_site",
      "act": 4,
      "title": "Reaching the failsafe relay site",
      "messages": [
        { "en": "Found it. Small concrete building, half buried. Looks military or research. Heavy door, still sealed.", "fr": "Trouvé. Petit bâtiment en béton, à moitié enterré. Ça a l'air militaire ou recherche. Porte lourde, encore scellée." },
        { "en": "I'm forcing the lock. Mechanical, like the maintenance room before. I'm getting good at this.", "fr": "Je force le verrou. Mécanique, comme la salle de maintenance d'avant. Je m'améliore." },
        { "en": "...", "fr": "..." },
        { "en": "I'm in. The terminal is here. Old interface, green text on black. Very retro.", "fr": "J'suis dedans. Le terminal est là. Ancienne interface, texte vert sur noir. Très rétro." },
        { "en": "Powering up.", "fr": "Je l'allume." },
        { "en": "...", "fr": "..." },
        { "en": "It's booting. Slowly. Come on...", "fr": "Ça démarre. Lentement. Allez..." }
      ],
      "choices": null,
      "next_node": "a4f_terminal_check",
      "delay": { "seconds": 600, "message": { "en": "The failsafe terminal is booting...", "fr": "Le terminal de sécurité démarre..." } },
      "on_enter": null
    },

    "a4f_terminal_check": {
      "id": "a4f_terminal_check",
      "act": 4,
      "title": "Terminal boot — conditional on records flag",
      "messages": [
        { "en": "It's up. Emergency shutdown protocol. It's asking for authorization codes.", "fr": "C'est lancé. Protocole d'arrêt d'urgence. Il demande des codes d'autorisation." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "on_enter": null,
      "branch": [
        { "condition": { "flags_required": ["has_facility_records"] }, "next_node": "a4f_codes_success" },
        { "condition": { "default": true }, "next_node": "a4f_codes_fail" }
      ]
    },

    "a4f_codes_success": {
      "id": "a4f_codes_success",
      "act": 4,
      "title": "Has codes — failsafe works",
      "messages": [
        { "en": "The data pad. From the overpass. It has facility access codes.", "fr": "La tablette de données. Du viaduc. Elle a les codes d'accès de l'installation." },
        { "en": "Entering the sequence...", "fr": "J'entre la séquence..." },
        { "en": "...", "fr": "..." },
        { "en": "Accepted.", "fr": "Accepté." },
        { "en": "\"Remote shutdown signal transmitted to primary emitter.\"", "fr": "\"Signal d'arrêt à distance transmis à l'émetteur principal.\"" },
        { "en": "The hum just... shifted. Slightly. Something is happening.", "fr": "Le bourdonnement vient de... changer. Légèrement. Y'a quelque chose qui se passe." },
        { "en": "I don't know if it worked. Not fully. I can't confirm from here.", "fr": "J'sais pas si ça a marché. Pas complètement. Je peux pas confirmer d'ici." },
        { "en": "I need to get to the facility to verify. And if the remote shutdown stalled, to finish it.", "fr": "Faut que j'aille à l'installation pour vérifier. Et si l'arrêt à distance a calé, pour finir le travail." }
      ],
      "choices": null,
      "next_node": "a4f_heading_back",
      "delay": null,
      "on_enter": { "flags_set": ["failsafe_succeeded"] }
    },

    "a4f_codes_fail": {
      "id": "a4f_codes_fail",
      "act": 4,
      "title": "No codes — failsafe locked",
      "messages": [
        { "en": "I don't have the codes.", "fr": "J'ai pas les codes." },
        { "en": "I'm trying combinations. Standard emergency overrides. Factory defaults. Anything.", "fr": "J'essaie des combinaisons. Les codes d'urgence standards. Les réglages d'usine. Tout." },
        { "en": "Access denied. Access denied. Access denied.", "fr": "Accès refusé. Accès refusé. Accès refusé." },
        { "en": "No. No no no.", "fr": "Non. Non non non." },
        { "en": "I came all this way and I don't have the damn codes.", "fr": "J'ai fait tout ce chemin et j'ai pas les foutus codes." },
        { "en": "There might have been data somewhere — records, access files. But I don't have them.", "fr": "Y'avait peut-être des données quelque part — des dossiers, des fichiers d'accès. Mais je les ai pas." }
      ],
      "choices": [
        {
          "label": { "en": "Keep trying. There might be a way to brute-force it.", "fr": "Continue d'essayer. Y'a peut-être moyen de forcer." },
          "next_node": "a4f_brute_force",
          "on_choose": {}
        },
        {
          "label": { "en": "Stop. Head to the facility. You'll have to do it manually.", "fr": "Arrête. Va à l'installation. Tu devras le faire manuellement." },
          "next_node": "a4f_heading_back",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": { "flags_set": ["failsafe_failed"] }
    },

    "a4f_brute_force": {
      "id": "a4f_brute_force",
      "act": 4,
      "title": "Brute-forcing the failsafe — fails",
      "messages": [
        { "en": "I've been trying for an hour. Every combination I can think of.", "fr": "J'essaie depuis une heure. Toutes les combinaisons possibles." },
        { "en": "\"Authorization attempts exceeded. Terminal locked.\"", "fr": "\"Tentatives d'autorisation dépassées. Terminal verrouillé.\"" },
        { "en": "It locked me out.", "fr": "Ça m'a verrouillée." },
        { "en": "...", "fr": "..." },
        { "en": "Fine. The old-fashioned way then.", "fr": "Bon. La méthode à l'ancienne alors." }
      ],
      "choices": null,
      "next_node": "a4f_heading_back",
      "delay": null,
      "on_enter": null
    },

    "a4f_heading_back": {
      "id": "a4f_heading_back",
      "act": 4,
      "title": "Heading to the facility",
      "messages": [
        { "en": "Heading back toward the facility. It's about two days.", "fr": "Je repars vers l'installation. C'est environ deux jours." },
        { "en": "Lost time. But I'm still here.", "fr": "Du temps perdu. Mais j'suis encore là." },
        { "en": "...", "fr": "..." },
        { "en": "I can see it on the horizon again. Waiting.", "fr": "Je la vois à l'horizon de nouveau. Elle attend." }
      ],
      "choices": null,
      "next_node": "a4d_gates",
      "delay": { "seconds": 7200, "message": { "en": "Elara is traveling toward the facility.", "fr": "Elara se dirige vers l'installation." } },
      "on_enter": { "health_change": -1, "supplies_change": -1 }
    },

    "a5_enter_facility": {
      "id": "a5_enter_facility",
      "act": 5,
      "title": "Entering the facility",
      "messages": [
        { "en": "I'm inside.", "fr": "J'suis à l'intérieur." },
        { "en": "Emergency lighting. Red-orange. Long corridors stretching into the dark.", "fr": "Éclairage de secours. Rouge-orangé. De longs couloirs qui s'étirent dans le noir." },
        { "en": "The hum is everywhere. Not from a direction — from everything. The walls. The floor. My teeth.", "fr": "Le bourdonnement est partout. Pas d'une direction — de tout. Les murs. Le sol. Mes dents." },
        { "en": "I can feel it in my chest. Like a second heartbeat.", "fr": "Je le sens dans ma poitrine. Comme un deuxième battement de cœur." }
      ],
      "choices": null,
      "next_node": "a5_inside_labs",
      "delay": { "seconds": 600, "message": { "en": "Elara is moving through the facility.", "fr": "Elara avance dans l'installation." } },
      "on_enter": null
    },

    "a5_inside_labs": {
      "id": "a5_inside_labs",
      "act": 5,
      "title": "Walking through the labs",
      "messages": [
        { "en": "Labs. Equipment still powered on. Screens showing data no one will ever read.", "fr": "Des labos. Du matériel encore allumé. Des écrans qui affichent des données que personne lira jamais." },
        { "en": "A cafeteria. Trays on tables. Coffee mugs. Someone left their lunch half-eaten.", "fr": "Une cafétéria. Des plateaux sur les tables. Des tasses de café. Quelqu'un a laissé son déjeuner à moitié mangé." },
        { "en": "They came to work that day. Like any other day.", "fr": "Ils sont venus travailler ce jour-là. Comme n'importe quel autre jour." },
        { "en": "A bulletin board. Photos pinned up. Families. Pets. A kid's drawing: \"Daddy's work.\"", "fr": "Un panneau d'affichage. Des photos épinglées. Des familles. Des animaux. Un dessin d'enfant : \"Le travail de papa.\"" },
        { "en": "They were people. Engineers. Scientists. Maintenance workers.", "fr": "C'étaient des gens. Des ingénieurs. Des scientifiques. Des agents de maintenance." },
        { "en": "They built the thing that ended the world. And they were just... people. That makes it worse.", "fr": "Ils ont construit le truc qui a mis fin au monde. Et c'étaient juste... des gens. Ça rend les choses pires." }
      ],
      "choices": null,
      "next_node": "a5_vasik_office",
      "delay": null,
      "on_enter": null
    },

    "a5_vasik_office": {
      "id": "a5_vasik_office",
      "act": 5,
      "title": "Dr. Vasik's office",
      "messages": [
        { "en": "Found his office. Vasik.", "fr": "J'ai trouvé son bureau. Vasik." },
        { "en": "His journal — the original. More entries than the copy at the relay station.", "fr": "Son journal — l'original. Plus d'entrées que la copie à la station relais." },
        { "en": "I'm not going to read them. Not now.", "fr": "Je vais pas les lire. Pas maintenant." },
        { "en": "He stayed until the end. Died at his desk.", "fr": "Il est resté jusqu'à la fin. Mort à son bureau." },
        { "en": "...", "fr": "..." },
        { "en": "The core is ahead. I can feel it pulling. Let's finish this.", "fr": "Le cœur est devant. Je le sens qui attire. On finit ça." }
      ],
      "choices": null,
      "next_node": "a5_the_core",
      "delay": { "seconds": 900, "message": { "en": "Elara is approaching the core.", "fr": "Elara approche du cœur." } },
      "on_enter": { "health_change": -1 }
    },

    "a5_the_core": {
      "id": "a5_the_core",
      "act": 5,
      "title": "The resonance emitter",
      "messages": [
        { "en": "I'm in the core chamber.", "fr": "J'suis dans la salle du cœur." },
        { "en": "...", "fr": "..." },
        { "en": "It's beautiful. I hate that that's the first word that comes to mind. But it is.", "fr": "C'est beau. Je déteste que ce soit le premier mot qui me vient. Mais c'est vrai." },
        { "en": "The emitter. Massive. Industrial. Every bolt, every circuit — someone solved a thousand problems to make this work perfectly.", "fr": "L'émetteur. Massif. Industriel. Chaque boulon, chaque circuit — quelqu'un a résolu mille problèmes pour que ça marche parfaitement." },
        { "en": "And it worked perfectly.", "fr": "Et ça a marché parfaitement." },
        { "en": "It's just a machine. That's all it ever was. Someone like me built this.", "fr": "C'est juste une machine. C'est tout ce que c'est. Quelqu'un comme moi a construit ça." },
        { "en": "The hum is deafening. I can barely think. My nose is bleeding again. Vision is going in and out.", "fr": "Le bourdonnement est assourdissant. J'arrive à peine à réfléchir. Mon nez saigne encore. La vision va et vient." },
        { "en": "I can see the manual shutdown mechanism. Valves, switches, a decoupling sequence. I understand it.", "fr": "Je vois le mécanisme d'arrêt manuel. Des vannes, des interrupteurs, une séquence de découplage. Je comprends tout." },
        { "en": "What do I do?", "fr": "Je fais quoi ?" }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "on_enter": { "health_change": -1 },
      "branch": [
        { "condition": { "flags_required": ["failsafe_succeeded"] }, "next_node": "a5_choice_failsafe_active" },
        { "condition": { "default": true }, "next_node": "a5_choice_manual" }
      ]
    },

    "a5_choice_failsafe_active": {
      "id": "a5_choice_failsafe_active",
      "act": 5,
      "title": "Last choice — failsafe sent signal",
      "messages": [
        { "en": "Wait. The emitter — it's running slower. The failsafe signal is working. It's winding down.", "fr": "Attends. L'émetteur — il tourne moins vite. Le signal de sécurité marche. Il ralentit." },
        { "en": "But it's slow. Hours, maybe. And it could stall without manual intervention.", "fr": "Mais c'est lent. Des heures, peut-être. Et ça pourrait caler sans intervention manuelle." }
      ],
      "choices": [
        {
          "label": { "en": "Wait it out. Shelter nearby and let the failsafe finish.", "fr": "Attends que ça finisse. Abrite-toi à côté et laisse la sécurité faire." },
          "next_node": "a5_wait_failsafe",
          "on_choose": {}
        },
        {
          "label": { "en": "Stay and monitor. If it stalls, you can intervene.", "fr": "Reste et surveille. Si ça cale, tu interviens." },
          "next_node": "a5_monitor_core",
          "on_choose": {}
        },
        {
          "label": { "en": "Leave now. The failsafe is running. You've done enough.", "fr": "Pars maintenant. La sécurité tourne. T'en as fait assez." },
          "next_node": "a5_walk_away",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a5_choice_manual": {
      "id": "a5_choice_manual",
      "act": 5,
      "title": "Last choice — manual shutdown only",
      "messages": [
        { "en": "No remote shutdown. This is all manual. All me.", "fr": "Pas d'arrêt à distance. Tout en manuel. Tout moi." },
        { "en": "The decoupling sequence takes time. Staying in this room for the process will be... hard on my body.", "fr": "La séquence de découplage prend du temps. Rester dans cette salle pendant le processus sera... dur pour mon corps." },
        { "en": "I might not walk out of here.", "fr": "Je sortirai peut-être pas d'ici." }
      ],
      "choices": [
        {
          "label": { "en": "Shut it down. Properly. Take your time and do it right.", "fr": "Éteins-le. Correctement. Prends ton temps et fais-le bien." },
          "next_node": "a5_shutdown_proper",
          "on_choose": {}
        },
        {
          "label": { "en": "Overload the emitter. Force it to burn out. Faster, but it'll destroy the facility.", "fr": "Surcharge l'émetteur. Force-le à griller. Plus rapide, mais ça détruira l'installation." },
          "next_node": "a5_shutdown_overload",
          "on_choose": {}
        },
        {
          "label": { "en": "Walk away. You don't owe the world your life.", "fr": "Pars. Tu dois pas ta vie au monde." },
          "next_node": "a5_walk_away",
          "on_choose": {}
        }
      ],
      "next_node": null,
      "delay": null,
      "on_enter": null
    },

    "a5_wait_failsafe": {
      "id": "a5_wait_failsafe",
      "act": 5,
      "title": "Waiting for failsafe to complete",
      "messages": [
        { "en": "I'm pulling back. Finding a room with a door between me and that machine.", "fr": "Je recule. Je cherche une pièce avec une porte entre moi et cette machine." },
        { "en": "...", "fr": "..." },
        { "en": "I can still hear it. But the walls help.", "fr": "Je l'entends encore. Mais les murs aident." },
        { "en": "Now I wait.", "fr": "Maintenant j'attends." }
      ],
      "choices": null,
      "next_node": "a5_ending_resolve",
      "delay": { "seconds": 3600, "message": { "en": "The emitter is winding down. Elara is sheltering nearby.", "fr": "L'émetteur ralentit. Elara s'abrite à proximité." } },
      "on_enter": { "health_change": -1, "flags_set": ["emitter_shutdown"] }
    },

    "a5_monitor_core": {
      "id": "a5_monitor_core",
      "act": 5,
      "title": "Monitoring in the core",
      "messages": [
        { "en": "I'm staying. If this thing stalls, I need to be here.", "fr": "Je reste. Si ce truc cale, faut que je sois là." },
        { "en": "The hum is... I can taste it. Metal and ozone.", "fr": "Le bourdonnement est... je le goûte. Du métal et de l'ozone." },
        { "en": "My hands won't stop shaking. But they don't need to be steady. They just need to reach the switches if it stalls.", "fr": "Mes mains arrêtent pas de trembler. Mais elles ont pas besoin d'être stables. Elles ont juste besoin d'atteindre les interrupteurs si ça cale." },
        { "en": "...", "fr": "..." },
        { "en": "It stalled. I knew it. Intervening now.", "fr": "Ça a calé. Je le savais. J'interviens." },
        { "en": "...", "fr": "..." },
        { "en": "Done. Sequence restarted. It's running again.", "fr": "C'est fait. Séquence relancée. Ça tourne de nouveau." }
      ],
      "choices": null,
      "next_node": "a5_ending_resolve",
      "delay": { "seconds": 1800, "message": { "en": "Elara is monitoring the shutdown sequence.", "fr": "Elara surveille la séquence d'arrêt." } },
      "on_enter": { "health_change": -2, "flags_set": ["emitter_shutdown"] }
    },

    "a5_shutdown_proper": {
      "id": "a5_shutdown_proper",
      "act": 5,
      "title": "Proper manual shutdown",
      "messages": [
        { "en": "Okay. Starting the sequence.", "fr": "Ok. Je lance la séquence." },
        { "en": "Valve one. Open. The machine screams — a sound like tearing metal.", "fr": "Vanne un. Ouverte. La machine hurle — un son comme du métal qui se déchire." },
        { "en": "Switch array. One by one. My fingers keep slipping.", "fr": "Tableau d'interrupteurs. Un par un. Mes doigts glissent." },
        { "en": "Core decoupling initiated. This is the long part. The frequency is spiking.", "fr": "Découplage du cœur initié. C'est la partie longue. La fréquence monte en flèche." },
        { "en": "I can't hear you over the hum. I hope you're still there.", "fr": "Je t'entends plus avec le bourdonnement. J'espère que t'es encore là." },
        { "en": "...", "fr": "..." },
        { "en": "Almost. Almost done.", "fr": "Presque. Presque fini." }
      ],
      "choices": null,
      "next_node": "a5_ending_resolve",
      "delay": { "seconds": 1200, "message": { "en": "The emitter is shutting down. Elara is in the core.", "fr": "L'émetteur s'arrête. Elara est dans le cœur." } },
      "on_enter": { "health_change": -3, "flags_set": ["emitter_shutdown"] }
    },

    "a5_shutdown_overload": {
      "id": "a5_shutdown_overload",
      "act": 5,
      "title": "Overloading the emitter",
      "messages": [
        { "en": "Overload it is. Reversing the dampeners. Opening all valves.", "fr": "Surcharge alors. J'inverse les amortisseurs. J'ouvre toutes les vannes." },
        { "en": "The machine is getting louder. The whole building is shaking.", "fr": "La machine est de plus en plus forte. Tout le bâtiment tremble." },
        { "en": "I need to run.", "fr": "Faut que je coure." },
        { "en": "NOW.", "fr": "MAINTENANT." }
      ],
      "choices": null,
      "next_node": "a5_ending_resolve",
      "delay": { "seconds": 300, "message": { "en": "The facility is shaking. The emitter is overloading.", "fr": "L'installation tremble. L'émetteur surcharge." } },
      "on_enter": { "health_change": -4, "flags_set": ["emitter_shutdown"] }
    },

    "a5_walk_away": {
      "id": "a5_walk_away",
      "act": 5,
      "title": "Walking away from the facility",
      "messages": [
        { "en": "...", "fr": "..." },
        { "en": "I'm leaving.", "fr": "Je pars." },
        { "en": "I can't. I thought I could but I can't.", "fr": "Je peux pas. Je pensais pouvoir mais je peux pas." },
        { "en": "Maybe that makes me a coward. Maybe it makes me alive.", "fr": "Peut-être que ça fait de moi une lâche. Peut-être que ça fait de moi une vivante." },
        { "en": "The hum is still there. It'll always be there.", "fr": "Le bourdonnement est toujours là. Il sera toujours là." }
      ],
      "choices": null,
      "next_node": "a5_ending_resolve",
      "delay": null,
      "on_enter": null
    },

    "a5_ending_resolve": {
      "id": "a5_ending_resolve",
      "act": 5,
      "title": "Ending resolution — routes to correct ending",
      "messages": [],
      "choices": null,
      "next_node": null,
      "delay": null,
      "on_enter": null,
      "branch": [
        { "condition": { "min_health": 7, "min_trust": 8, "flags_required": ["emitter_shutdown"] }, "next_node": "ending_still_here" },
        { "condition": { "min_health": 3, "min_trust": 5, "flags_required": ["emitter_shutdown"] }, "next_node": "ending_let_go" },
        { "condition": { "min_health": 1, "flags_required": ["emitter_shutdown"], "max_trust": 4 }, "next_node": "ending_echo" },
        { "condition": { "min_health": 1, "flags_required": ["emitter_shutdown"] }, "next_node": "ending_static" },
        { "condition": { "max_trust": 4 }, "next_node": "ending_echo" },
        { "condition": { "default": true }, "next_node": "ending_static" }
      ]
    },

    "ending_still_here": {
      "id": "ending_still_here",
      "act": 5,
      "title": "ENDING — Still Here (Good)",
      "messages": [
        { "en": "It stopped.", "fr": "Ça s'est arrêté." },
        { "en": "The hum. It's gone. I didn't realize how loud it was until it wasn't.", "fr": "Le bourdonnement. Il est parti. J'avais pas réalisé à quel point c'était fort jusqu'à ce que ça s'arrête." },
        { "en": "...", "fr": "..." },
        { "en": "I'm sitting outside. On the ground. Like an idiot. Just sitting.", "fr": "J'suis assise dehors. Par terre. Comme une idiote. Juste... assise." },
        { "en": "The sky looks different. I don't know if that's real or if I want it to be.", "fr": "Le ciel a l'air différent. J'sais pas si c'est réel ou si j'ai juste envie que ça le soit." },
        { "en": "...", "fr": "..." },
        { "en": "I don't know what happens now.", "fr": "Je sais pas ce qui se passe maintenant." },
        { "en": "There's no one to go back to. No one waiting.", "fr": "Y'a personne vers qui rentrer. Personne qui attend." },
        { "en": "But I'm here. I'm still here.", "fr": "Mais j'suis là. J'suis encore là." },
        { "en": "And I know who I am. I know that because of you.", "fr": "Et je sais qui je suis. Je le sais grâce à toi." },
        { "en": "Not because you told me. Because you listened.", "fr": "Pas parce que tu me l'as dit. Parce que tu as écouté." },
        { "en": "...", "fr": "..." },
        { "en": "I'm going to keep going. I don't know where. But I'm going to walk until I find something worth stopping for.", "fr": "Je vais continuer. J'sais pas où. Mais je vais marcher jusqu'à ce que je trouve quelque chose qui vaut le coup de s'arrêter." },
        { "en": "And I'm keeping the radio on.", "fr": "Et je garde la radio allumée." },
        { "en": "Just in case.", "fr": "Au cas où." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "ending": "still_here",
      "on_enter": null
    },

    "ending_let_go": {
      "id": "ending_let_go",
      "act": 5,
      "title": "ENDING — Let Go (Good)",
      "messages": [
        { "en": "It's done. The machine is dead.", "fr": "C'est fait. La machine est morte." },
        { "en": "I'm alive. I think. Most of me, anyway.", "fr": "J'suis vivante. Je crois. En grande partie, du moins." },
        { "en": "...", "fr": "..." },
        { "en": "I need to tell you something and I need you to not argue with me.", "fr": "Faut que je te dise un truc et j'ai besoin que tu discutes pas." },
        { "en": "I'm turning the radio off.", "fr": "Je vais éteindre la radio." },
        { "en": "Not because you did something wrong. The opposite.", "fr": "Pas parce que t'as fait quelque chose de mal. Le contraire." },
        { "en": "You kept me here. In my own head. In my own skin. When everything was trying to pull me out of it.", "fr": "Tu m'as gardée ici. Dans ma propre tête. Dans ma propre peau. Quand tout essayait de m'en arracher." },
        { "en": "But I think... I think I need to learn to be okay with the quiet.", "fr": "Mais je crois... je crois que j'ai besoin d'apprendre à supporter le silence." },
        { "en": "If I keep talking to you, I'll never stop reaching for someone. And I need to know I can stand in the silence without disappearing.", "fr": "Si je continue à te parler, j'arrêterai jamais de chercher quelqu'un. Et j'ai besoin de savoir que je peux rester debout dans le silence sans disparaître." },
        { "en": "...", "fr": "..." },
        { "en": "Lina used to hum this melody. She didn't know she did it.", "fr": "Lina fredonnait une mélodie. Elle savait même pas qu'elle le faisait." },
        { "en": "I'm going to hum it now. For her. For me.", "fr": "Je vais la fredonner maintenant. Pour elle. Pour moi." },
        { "en": "And then I'm going to turn this off and walk.", "fr": "Et après j'éteins et je marche." },
        { "en": "...", "fr": "..." },
        { "en": "Thank you. For all of it.", "fr": "Merci. Pour tout." },
        { "en": "Goodbye.", "fr": "Au revoir." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "ending": "let_go",
      "on_enter": null
    },

    "ending_static": {
      "id": "ending_static",
      "act": 5,
      "title": "ENDING — Static (Bittersweet)",
      "messages": [
        { "en": "The sequence is stalling. There isn't enough power to decouple the core.", "fr": "La séquence bloque. Y'a pas assez de puissance pour découpler le cœur." },
        { "en": "...", "fr": "..." },
        { "en": "I've been staring at this radio for five minutes.", "fr": "Ça fait cinq minutes que je fixe cette radio." },
        { "en": "You know what's funny? I built this thing to find someone. And I found you.", "fr": "Tu sais ce qui est drôle ? J'ai construit ce truc pour trouver quelqu'un. Et je t'ai trouvé." },
        { "en": "And now I need to take it apart to finish what we started.", "fr": "Et maintenant faut que je le démonte pour finir ce qu'on a commencé." },
        { "en": "...", "fr": "..." },
        { "en": "I'm going to use the oscillator to bridge the power gap. The cell will feed the decoupling.", "fr": "Je vais utiliser l'oscillateur pour compenser le manque de puissance. La cellule alimentera le découplage." },
        { "en": "It'll work. I know it will. I'm good at this part.", "fr": "Ça marchera. Je le sais. C'est la partie où j'suis douée." },
        { "en": "But the radio won't survive. Which means this is it.", "fr": "Mais la radio survivra pas. Ce qui veut dire que c'est la fin." },
        { "en": "...", "fr": "..." },
        { "en": "I don't know if you can hear me rushing or if there's a delay or if this is all instant for you.", "fr": "J'sais pas si tu m'entends en accéléré ou si y'a un délai ou si tout est instantané pour toi." },
        { "en": "But I want you to know —", "fr": "Mais je veux que tu saches —" },
        { "en": "You were real. Whatever this was. You were real to me.", "fr": "T'étais réel. Quoi que ça ait été. T'étais réel pour moi." },
        { "en": "Okay. I'm pulling the oscillat", "fr": "Ok. J'enlève l'oscillat" }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "ending": "static",
      "on_enter": { "flags_set": ["radio_sacrificed"] }
    },

    "ending_gone_dark": {
      "id": "ending_gone_dark",
      "act": 5,
      "title": "ENDING — Gone Dark (Bad — death)",
      "messages": [
        { "en": "I need to rest for a minute.", "fr": "Faut que je me pose une minute." },
        { "en": "Just a minute.", "fr": "Juste une minute." },
        { "en": "...", "fr": "..." },
        { "en": "hey. sorry. got dizzy.", "fr": "hé. pardon. j'ai eu un vertige." },
        { "en": "im fine. just need to", "fr": "ça va. j'ai juste besoin de" },
        { "en": "...", "fr": "..." },
        { "en": "can you hear me? the signal keeps", "fr": "tu m'entends ? le signal arrête pas de" },
        { "en": "...", "fr": "..." },
        { "en": "i think im going to close my eyes for a bit", "fr": "je crois que je vais fermer les yeux un peu" },
        { "en": "just for a bit", "fr": "juste un peu" },
        { "en": "lina?", "fr": "lina ?" },
        { "en": "...", "fr": "..." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "ending": "gone_dark",
      "on_enter": null
    },

    "ending_echo": {
      "id": "ending_echo",
      "act": 5,
      "title": "ENDING — Echo (Bad — hollowed out)",
      "messages": [
        { "en": "Okay. It's done.", "fr": "Ok. C'est fait." },
        { "en": "The machine is off. I think. The sound stopped.", "fr": "La machine est éteinte. Je crois. Le bruit s'est arrêté." },
        { "en": "...", "fr": "..." },
        { "en": "So. What now?", "fr": "Donc. On fait quoi maintenant ?" },
        { "en": "...", "fr": "..." },
        { "en": "I'm fine, by the way. In case you were wondering.", "fr": "Ça va au fait. Au cas où tu te poserais la question." },
        { "en": "I'm good. Really.", "fr": "J'suis bien. Vraiment." },
        { "en": "...", "fr": "..." },
        { "en": "Hello? Are you still there?", "fr": "Allô ? T'es encore là ?" },
        { "en": "...", "fr": "..." },
        { "en": "That's okay. I'll wait.", "fr": "C'est pas grave. J'attends." },
        { "en": "I'm good at waiting.", "fr": "J'suis douée pour attendre." },
        { "en": "...", "fr": "..." },
        { "en": "Hey. You know what's funny?", "fr": "Hé. Tu sais ce qui est drôle ?" },
        { "en": "I keep humming this song. I can't remember where it's from.", "fr": "J'arrête pas de fredonner une chanson. J'arrive plus à me rappeler d'où elle vient." },
        { "en": "Isn't that weird?", "fr": "C'est bizarre, non ?" },
        { "en": "Anyway.", "fr": "Bref." },
        { "en": "Just let me know what to do next.", "fr": "Dis-moi juste quoi faire après." },
        { "en": "I'll be here.", "fr": "J'suis là." }
      ],
      "choices": null,
      "next_node": null,
      "delay": null,
      "ending": "echo",
      "on_enter": null
    }
  },

  "death_check": {
    "description": "After every on_enter health_change, check if health <= 0. If so, immediately route to ending_gone_dark regardless of current node.",
    "trigger": "after_any_health_change",
    "condition": { "health_equals": 0 },
    "override_next_node": "ending_gone_dark"
  }
}
